#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show summary</summary>

```# google_compute_instance.controller[0] must be replaced
# forces replacement
# google_compute_instance.controller[1] must be replaced
# forces replacement
# google_compute_instance.controller[2] will be created
# google_compute_instance.worker[0] will be updated in-place
# google_compute_target_pool.target-pool will be updated in-place
```

</details>

<details><summary>Show detail</summary>

```terraform
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

tls_private_key.scheduler: Refreshing state... [id=cb29a937ec6aa00046ff94e65167efbe647d31b9]
tls_private_key.service-account: Refreshing state... [id=1a55c51e150a83ec164780a33b2b905f8e084a3a]
tls_private_key.proxy: Refreshing state... [id=c2b4517bbbd7571c58dd8e174aff84cd6c8b2fcc]
tls_private_key.controller: Refreshing state... [id=789adffaaa6822703b0b47cf24b225d2699c7313]
tls_private_key.api-server: Refreshing state... [id=208028db437b440c5bed23e72f95c88b21c959d8]
tls_private_key.ca: Refreshing state... [id=650093a0b6890d9d02f26af503c8d703bc00632d]
tls_private_key.admin: Refreshing state... [id=dde21c5a953bad9e938c1e2d3f3c9623477b3271]
tls_private_key.ssh-key: Refreshing state... [id=01a4c55b9796dfa4b0396f8c901c8ae4525c5e12]
tls_cert_request.scheduler: Refreshing state... [id=4c390bcca2c8af678df6ba2b46bc28ceb4a819b8]
tls_cert_request.service-account: Refreshing state... [id=59de72af01eddc45689b29114d745207c0b9efd0]
tls_cert_request.controller: Refreshing state... [id=3f33ea7d266f61d53dcafa07349e62ccee6f840a]
tls_cert_request.proxy: Refreshing state... [id=21412161ae1ee95fae2b4ef72c27705248e06ba0]
tls_self_signed_cert.ca: Refreshing state... [id=187718146637770464760329609867804296758]
tls_cert_request.admin: Refreshing state... [id=7b1547ecc83989d49cdd2fd8b48c50f435546fe7]
tls_locally_signed_cert.controller: Refreshing state... [id=227906084365593498815655393818869149306]
tls_locally_signed_cert.proxy: Refreshing state... [id=14924341416291345069094510694403008923]
tls_locally_signed_cert.scheduler: Refreshing state... [id=291365125533259693992283115366260599961]
tls_locally_signed_cert.service-account: Refreshing state... [id=243519028573833159605845894539963722323]
tls_locally_signed_cert.admin: Refreshing state... [id=237316286214898547219139621166159648884]
google_compute_network.vpc_network: Refreshing state... [id=projects/kube-293902/global/networks/kubernetes-the-hard-way]
google_compute_http_health_check.kubernetes: Refreshing state... [id=projects/kube-293902/global/httpHealthChecks/kubernetes]
google_compute_address.public_address: Refreshing state... [id=projects/kube-293902/regions/australia-southeast1/addresses/kubernetes-the-hard-way]
google_compute_target_pool.target-pool: Refreshing state... [id=projects/kube-293902/regions/australia-southeast1/targetPools/kubernetes-target-pool]
google_compute_firewall.firewall-allow-health-check: Refreshing state... [id=projects/kube-293902/global/firewalls/kubernetes-the-hard-way-allow-health-check]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/kube-293902/regions/australia-southeast1/subnetworks/kubernetes]
google_compute_firewall.firewall-allow-external: Refreshing state... [id=projects/kube-293902/global/firewalls/kubernetes-the-hard-way-allow-external]
google_compute_firewall.firewall-allow-worker-0-nodeport: Refreshing state... [id=projects/kube-293902/global/firewalls/kubernetes-the-hard-way-allow-nginx-service]
google_compute_firewall.firewall-allow-internal: Refreshing state... [id=projects/kube-293902/global/firewalls/kubernetes-the-hard-way-allow-internal]
google_compute_forwarding_rule.forwarding-rule: Refreshing state... [id=projects/kube-293902/regions/australia-southeast1/forwardingRules/kubernetes-forwarding-rule]
tls_cert_request.api-server: Refreshing state... [id=dc1718b77f7435885e8ef9eb9e2ab2ada1bb22ef]
tls_locally_signed_cert.api-server: Refreshing state... [id=120294878115874369596897786857905559848]
google_compute_route.route[0]: Refreshing state... [id=projects/kube-293902/global/routes/kubernetes-route-10-200-0-0-24]
google_compute_route.route[1]: Refreshing state... [id=projects/kube-293902/global/routes/kubernetes-route-10-200-1-0-24]
google_compute_route.route[2]: Refreshing state... [id=projects/kube-293902/global/routes/kubernetes-route-10-200-2-0-24]
google_compute_instance.worker[0]: Refreshing state... [id=projects/kube-293902/zones/australia-southeast1-a/instances/worker-0]
google_compute_instance.worker[2]: Refreshing state... [id=projects/kube-293902/zones/australia-southeast1-a/instances/worker-2]
google_compute_instance.worker[1]: Refreshing state... [id=projects/kube-293902/zones/australia-southeast1-a/instances/worker-1]
google_compute_instance.controller[0]: Refreshing state... [id=projects/kube-293902/zones/australia-southeast1-a/instances/controller-0]
google_compute_instance.controller[1]: Refreshing state... [id=projects/kube-293902/zones/australia-southeast1-a/instances/controller-1]
kubernetes_deployment.nginx: Refreshing state... [id=default/scalable-nginx-example]
kubernetes_service.nginx: Refreshing state... [id=default/nginx-example]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.controller[0] must be replaced
-/+ resource "google_compute_instance" "controller" {
        can_ip_forward          = true
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/kube-293902/zones/australia-southeast1-a/instances/controller-0" -> (known after apply)
      ~ instance_id             = "4371894788115776063" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "e2-micro"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "4zM5LHT3_ac=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            cat > ~/ca.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDsjCCApqgAwIBAgIRAI05MzFUTgunWEoPCinQRjYwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMGMxCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTETMBEGA1UEChMKS3Vi
            ZXJuZXRlczELMAkGA1UECxMCQ0ExEzARBgNVBAMTCkt1YmVybmV0ZXMwggEiMA0G
            CSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCl7SCQfw18s5+TPd/nm4LVsZP+uCYT
            ismhZtoTRiRRH9kxoVorSePWGtRpv31rU5RYOdY767xPJcujd8/Xe5eJOXoTnqGt
            S81iaiW3zs3SCBpzXL2jAR8mV8XAWBOUs7egtB1IECxwfNalsWnCZcA+rUGgeu0g
            8M+XCcJTSAsthZfrvN30NS02ur7dY+nTJK3wxiYsWoWOVaF9gl6pTIXncjx98V47
            JJ7QwvjL4fu1bIJXV7IpwkWum77OJXyozG1RsCwZgd4W4tjvIr1RDxBLeVdTrsuc
            tRt87SsDgAW9QUrWtKUsEgGHUtxVCq9wFsXQn1KY7cTT5kShAs7ZWEdXAgMBAAGj
            YTBfMA4GA1UdDwEB/wQEAwICJDAdBgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUH
            AwIwDwYDVR0TAQH/BAUwAwEB/zAdBgNVHQ4EFgQU+Wjpvvl8UbxxJwABRdAzJGnB
            daIwDQYJKoZIhvcNAQELBQADggEBABDhScswvvmTQTseZBKxjLrqDLtr6eH7dQ/7
            JhmbumOLSkzuAS1Pexqnjj3K9VAEqLip2ZuRTa/Sz80eodxMm6Nlrsp5IiZKMpep
            vt5yem56ND5UsiphrYlaaFgMvO61eGNdEktD746Rqk9gFBDGQZ2Rq/EI+fNMdRZ4
            KmkS86865FDsH1RSyTrQas0B3331Yc8hKffkdFEinzLAVrTKVE2zpemxVeJIu2pB
            ps0G1hmv7vh2QQ7tpTt+zVzBAfQKyeBHVRpEVhPTGY5fuKgAbUAmZQ0BGopUCbb6
            6lg/ea7Lzd6cGrnoBmKvU6eDtXr94UXMZ6AIEy/uASNlfhCy3Hs=
            -----END CERTIFICATE-----
            EOF
            cat > ~/ca-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpAIBAAKCAQEApe0gkH8NfLOfkz3f55uC1bGT/rgmE4rJoWbaE0YkUR/ZMaFa
            K0nj1hrUab99a1OUWDnWO+u8TyXLo3fP13uXiTl6E56hrUvNYmolt87N0ggac1y9
            owEfJlfFwFgTlLO3oLQdSBAscHzWpbFpwmXAPq1BoHrtIPDPlwnCU0gLLYWX67zd
            9DUtNrq+3WPp0ySt8MYmLFqFjlWhfYJeqUyF53I8ffFeOySe0ML4y+H7tWyCV1ey
            KcJFrpu+ziV8qMxtUbAsGYHeFuLY7yK9UQ8QS3lXU67LnLUbfO0rA4AFvUFK1rSl
            LBIBh1LcVQqvcBbF0J9SmO3E0+ZEoQLO2VhHVwIDAQABAoIBACf08JCbZ/4Nq3Hj
            xpWZp2oad08xvUmbdG6/u+hETd6TUtRWzMX75zfaAijtCiDcYa7VTrfjTteofF+D
            LLPxeU58Xt92pex7gpwef7LBxGK9vNDnFmu4i23KWT62dxCqLqAuf5ao/mqgRXhl
            PtindCIjytgAgjYah4MRwJAZm0d8rtlqK4fBdhJ7u7ic1RrjmLizNNeT5nmXm7gq
            aSxje90AodsLRLscZYmVoDxub+5slluj9Ikst7DTX4yv2IV8I8zTAuY7aQ7PCIC7
            vXYOl8r1dinemjSUjIkIKEbkvwsdMfQKvkApni+5sZDNdzgxfp3RVGDtO7nk+stF
            7Mfa1ZECgYEAwJ+bIUJYDllXE1wRJOTIAqB7JnGbyo6fvu/KmzUlquUnYaAOadfr
            35uGZiWkSMnTxySRjzu6P8doC0F8MK6BqcgFBAYQ+mL11lHCw65GN3evIQ+fLBop
            ArLJ2AmBoXYBT7S9Kv4pbChtZtjTzggjUt2kSd9zVoOllI2ueWLkWy0CgYEA3ITb
            OamjzF2adhFKwrrEjgvPHDu49HZAlfYt1Kre7W2aQlRhBypVH4dUGKJN+pprEpfs
            UV5TRkaIJFEj19ibQ5ptjbqkYu/YQiwl9zS9hvNu1kfgc3/Xot6hTsZDuKmLnlQU
            Dc7roJs1Ps/2g+GY00fZjPyKzbUJ4c4WJEBxbxMCgYEAvq/CNMSmw12yE9o6pplN
            XzxbbY1eOsHCZpSfr9KHPYyo1b5LRoCYYr5l6E0vO1eBrU0IRBFOqcDPwQTM2qyG
            c/ss6/TNbfH1iHtcIbcuj86Nsl7ypggnvSIdKx8OEzbsyWkVM7B0dTv4Qa44z2fD
            AE+mSfNJDMY6brtrk4NQqOkCgYATfSpizjtLtHoSNTUGQLteUmzbcevGryzGFBu4
            z+Ej2qvncM2idHtRbgRgqPd7TmpoGkUoa82wSEt/6ivgx6PxNZS5EeW1WL0kHAK+
            9kpJwvnotjGAA6xrGIHpFFyn1VQhigy7q63nY9Aw3PBMd4OqKI9xhmA+DeHxsuUC
            Dy/3QQKBgQCEvCGF6oBa3ss7FyiF+JcirUIv7ZtYXfYWqGk2YUwr8x/QmBNjARem
            gdfHfpkwSaduTcuFzZ8bWlUr2/I0gpTX5kFQ6vdNbtTXxJJQaKYXx4uKnYuBEEUd
            mrVQKZb2/OpJfxFufdwq16AD8weB1ahqE6Dx71cnDfkmKS+DWPNs7A==
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kubernetes.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIEcTCCA1mgAwIBAgIQWn/zZxpgw8N8jL3i+OmZKDANBgkqhkiG9w0BAQsFADBj
            MQswCQYDVQQGEwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxEzAR
            BgNVBAoTCkt1YmVybmV0ZXMxCzAJBgNVBAsTAkNBMRMwEQYDVQQDEwpLdWJlcm5l
            dGVzMB4XDTIwMTEwODIzMTgwOFoXDTIxMTEwODIzMTgwOFoweDELMAkGA1UEBhMC
            QVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMwEQYDVQQKEwpLdWJl
            cm5ldGVzMSAwHgYDVQQLExdLdWJlcm5ldGVzIFRoZSBIYXJkIFdheTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAKZA
            Ux8gukEg7Z5ZeYw5cxZiBJGjQBv6YPyPvAa1q6N9Dw7V0bWj4ks5ysclLiXHj8ou
            hoYKpGSH/h9wlIKZCCB/RCbprmTvM+xtzb5CUwaV6enT87WTfAnESJ0/Ag9mwoQG
            G1Eo/4Gmrd4DaBKYhLFtn9swm1sfYFDhjmBDLpreO5hPVbEYQhzkK2bi1xVxIf5O
            mA164HiZ6tXYs/s4NYUYq3IsEeiVmbApdw2kRQquCR3+7QgZmhX9AQ0EvSt+vBHQ
            EahWs1+Dvg604YmhERC4lsr0YPF50Li8ZrQ5O77XL7G1rmBc9q1VzjBoKdpPPMh1
            yfGWeb7o3J5M4Zge7K0CAwEAAaOCAQowggEGMA4GA1UdDwEB/wQEAwIFoDAdBgNV
            HSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0TAQH/BAIwADAfBgNVHSME
            GDAWgBT5aOm++XxRvHEnAAFF0DMkacF1ojCBpQYDVR0RBIGdMIGaggprdWJlcm5l
            dGVzghJrdWJlcm5ldGVzLmRlZmF1bHSCFmt1YmVybmV0ZXMuZGVmYXVsdC5zdmOC
            Hmt1YmVybmV0ZXMuZGVmYXVsdC5zdmMuY2x1c3RlcoIca3ViZXJuZXRlcy5zdmMu
            Y2x1c3Rlci5sb2NhbIcECiAAAYcEfwAAAYcEI702BIcECvAACocECvAAC4cECvAA
            DDANBgkqhkiG9w0BAQsFAAOCAQEAcSkuf61E4kgKErKEb3kB69KH4Nxj1/oMWd4V
            WE80KWE20wi1VeK4p2TD9KT6vUQhCaxKSPsH3omhWhbJlKAkzwph82ZXsJ2yuab1
            +1JIxWgjb8VIPI1dFi0T8nO6B8K1qq33HdfT/7ltpdZcv/w09sSJa+jmYlSo7RRJ
            TCqyVoQO1jKJJii4AfM0kC+74FaLdzV/TNGobWb4qvOKkKdrZYz99GDAwQL7Wxpg
            i2Oo/O0sEsy9URp4T1aA83s5kIEzNQ5LWXCkRoSPkmeQw97EB8fFS/6daEcDEup/
            3n15w/DR8y4miruUQ821kNRdRm6mUls1fD+volhd/u1uWQVvEw==
            -----END CERTIFICATE-----
            EOF
            cat > ~/kubernetes-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEowIBAAKCAQEApkBTHyC6QSDtnll5jDlzFmIEkaNAG/pg/I+8BrWro30PDtXR
            taPiSznKxyUuJcePyi6GhgqkZIf+H3CUgpkIIH9EJumuZO8z7G3NvkJTBpXp6dPz
            tZN8CcRInT8CD2bChAYbUSj/gaat3gNoEpiEsW2f2zCbWx9gUOGOYEMumt47mE9V
            sRhCHOQrZuLXFXEh/k6YDXrgeJnq1diz+zg1hRirciwR6JWZsCl3DaRFCq4JHf7t
            CBmaFf0BDQS9K368EdARqFazX4O+DrThiaERELiWyvRg8XnQuLxmtDk7vtcvsbWu
            YFz2rVXOMGgp2k88yHXJ8ZZ5vujcnkzhmB7srQIDAQABAoIBAGR+V4BmaQ+7Vsc0
            MKvZgj7Saw6ZzsPaukuQmsi3ghPmIXcHOqeAc+ai/XcZe2as1bcSHpDh1/NI3Qym
            Ia87z9TM+SZIdPlgOlO9H/PU5ZkCf42vaA6nIwBIXNhoYNdsd0IU6uhJTwFQ/qJI
            Dt3Gwdb6e/mjzRTsx2y8mzKHCaHkoErrl1zCjqB2JVszGDlwti35LnFZ/ql5sVan
            lQ4TcYPodJz1jWaWn8++m4WEWLynJaW7QEDvlhAWM/bnDkZRWDp0stfd4lf2ypLH
            7sPipGdc8Us0lnYvcWW4DHWCaOCOKLYZurzii+L0IhQGMAKKWMCoU8Y3cgKqjHrW
            u570PSUCgYEA0vJE+9VXGqqLClix8QQwhq4NF3myYca6mojVdwh17RGyzEbsTFoI
            rhrmd9oBtR10Mq4XAaJrVCxZ4zCFHv1K2vT/xVlsiAGD0jF1qR4zGC+XjclCVlZy
            XKaJWibV2Ooyqur+8fZoPadLp8kSChB9nl9nv26HgjXW8u6MbPCN5vMCgYEAycJM
            5ZuPPnirbtAWHDKhSkRCe1iN5u1Sf0Jm+JflrdpzaBz5GUlhAcw2qlA+d7Mrl9AQ
            aWiq1dCjwY356EsDevw5qzO169GjzkHY4ajKv4OyQywCvlcWD4f5/+VNAuzlIejM
            j1RiH27rxwiUWTTtbiGaD6pO9etOAP5A0V0ABd8CgYBoNopAA8ixgtmH9gOKt3Al
            ySzskRHAXkZn+/vBf6uKwDid1Nf+bGhnYyDCyzAWwwNZ2knBY/U0M2kA5UKO6cGm
            ZG1LmP8WPfFa0VZ4g1PoufJceLZOIw0Cmr+2iwMQ07rOV6Q1827SLqkgriQ8VqNI
            r4d4umk1udWEVLeJRlpEYwKBgQCxVXGHQuJ1s1RjEszMPggcIcEZby1ScvfW2QNu
            rvv2ghJ7yTN88U0talQGAH/XcAj556v1KkU1p6u3XVXxwbUubPE3ND1LJ7lFegTp
            2xVRnayac915dUvznL21GNNGpfeDhX3+4NlZ7YGZMEZL3kRuT2R9LmE2r3qhTtij
            7I0vmwKBgHCxyHVndrY20pa5XaBmoShTzDYVbmjdpkswWkxQMDLfjd3SzXa1w+Ng
            S+NuJGP4k4szn6P2x4fZaYII7Xahr9y+3KitlrZo0BO10zQr8GKp7DStN8LoJC39
            vLjUTm4Yqs/bu7Td+3oyz5FY1HfpKCHA4VJFX/fg5a2tandeRK5S
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/service-account.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDyzCCArOgAwIBAgIRALc0DxUb1Y/zZzlZszmu6lMwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMH0xCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTETMBEGA1UEChMKS3Vi
            ZXJuZXRlczEgMB4GA1UECxMXS3ViZXJuZXRlcyBUaGUgSGFyZCBXYXkxGDAWBgNV
            BAMTD3NlcnZpY2UtYWNjb3VudDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoC
            ggEBANq7uilBfSef6lVXc7qwM6VPA6ojq3ABYXx3a8NgoH3ys8UV5+3TMuaiS5iE
            pRuysKnA2LUMtbcCm+8BLptUOJYDDFmzwj3m0MSXhuv431GWtmgvuhF6NJcU35ax
            bm7zeNERP7lOr/fGQEJZLt4QD1G8UN8JD69x48QxhNsma2AxMQL68EyhHpelA6sY
            aVRns9KP6E4VHQqVyuD8xbn1ZAoFlm61pf2fDSrBB8M1y+Wx1Vg9q2qQl69JfL8G
            7odxLVwuJAGuGnUjxoN4ZOwGANMLTk0xfDD+8iSSY4T04+SXGxuZ39GMf4EnExrR
            gG2MbOwaX4ay+GDi0Cj5p270tm8CAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0G
            A1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1Ud
            IwQYMBaAFPlo6b75fFG8cScAAUXQMyRpwXWiMA0GCSqGSIb3DQEBCwUAA4IBAQA/
            nGEnJCVcmhm8R0DB/he6p46XHjAW6nV2bjJNKkmkIi7mOgl8N3IF0pM8FSRzNPDO
            MbIDNzq1wHN/p8lfqn09jSPpmQ46fLZibZriDt7wr/w87eHfJhSWF4okd/IMlrXn
            RhqT+TL+wx0wTyYCKzE0N6iUNoSU92CPEygv+iRs5qfcCYJzqnXbDN0TcU9yGCGF
            wGBMkuX1ujVRmOZKycGNThq3m/WuR34Al38m5Tv/tvj3OQGbTQnKdrOB2Pbp/7BF
            cy2QZk5xp8IBv0TJolsPdiGTHV76c/anA33DGWdijCYQMZdJ9UXO3pGzwN0JXN3L
            h5swGi64e+Mi9iTaEQ9T
            -----END CERTIFICATE-----
            EOF
            cat > ~/service-account-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpgIBAAKCAQEA2ru6KUF9J5/qVVdzurAzpU8DqiOrcAFhfHdrw2CgffKzxRXn
            7dMy5qJLmISlG7KwqcDYtQy1twKb7wEum1Q4lgMMWbPCPebQxJeG6/jfUZa2aC+6
            EXo0lxTflrFubvN40RE/uU6v98ZAQlku3hAPUbxQ3wkPr3HjxDGE2yZrYDExAvrw
            TKEel6UDqxhpVGez0o/oThUdCpXK4PzFufVkCgWWbrWl/Z8NKsEHwzXL5bHVWD2r
            apCXr0l8vwbuh3EtXC4kAa4adSPGg3hk7AYA0wtOTTF8MP7yJJJjhPTj5JcbG5nf
            0Yx/gScTGtGAbYxs7BpfhrL4YOLQKPmnbvS2bwIDAQABAoIBAQCzY+VA8rHnbpLs
            XSXQBbTFrfDueAShfrBqOTMLcNMPmJ5xVA78EQuc9ZwUQS18cufKwRu6GOtrZdtn
            gEuuHrut5GAbrX7v775mjXOdUmYs7vM4rXPn45cAFaFuYKSWoF4E8SWXH/7XsiN/
            hs8WVouJ2G1nDnJrzHclsAsrBO5pW0mYUJVrxQOl7FNux3sKAynmuAGSCZxKZTRf
            9Fmxr4U43ddsapYGpt2Qspm1tyxr7DYuuiDE67uPFL09flJJR1oxZ+/IY6E1ojGI
            dcege6sEzItAM7u6MqA69JpNRrDZSq/MuosZDpG7tVOOXTFnUI+6gjTRl4o8VftC
            zQZt67f5AoGBANxRM51rOKKn57SsCem37RnCvyP213ODNfe6ycg4ZOOscits2taP
            Of/X4+dRfuL7VRIe802wE7bZziGkc+pQQYwE69XcT6N27d4mPXnVyLcHzjFTJlPx
            GLJI4uTieR4FtBXwuBO845/VrUZcCTj6rBtVlMrzidt/P9vI5vRSrNa9AoGBAP4o
            2sC3MBqbesFS76U54ueN7DWT+esQ5TSgI8UPoW8URlulTqL6Z6RbTr0PedR7deBy
            +OUL4NWjJD3Eo8X4rgQIm+Tk8b/OgO+/kCUVTLokqys21RDHSY7mbm649aUXtJTo
            wxiz+sSFJNLxdyAg9auk5+/hVP+x723mtDjaNZqbAoGBAMSJT5ELWC+JtyIuIn2z
            DLjhSJ+tkM9D6n2+zEhnPmD3sbVZWvLyO9wmW/E7ewTDDkWnBIZ2H3ALZl4OlTUe
            OQrOTQ+vg/+flVyKImcwNehI90B7G4LgXZaVfIqQGVmV3ut/nMZGx4wLEpLkgXmp
            7KRJuP0/Oehr4KyQ0K59nh/FAoGBAKy9G6ArYRhUX+QQ+Ct14k+6V7Y6cntfKkjQ
            Jj+C1hdm0kLrYTzHr7U3EZbRc94EYyM/QQZ7Qj4w+Sq6AQ1GbQ70wu+Y4u2X7m4D
            5nYtuc4xqdxfEgSrTcU/vAKo1ttz9xnV8PNTL7ZtP4/W6T3+6LnWBIU2wsxeJPqu
            +AJD3HbNAoGBANiFVEe3KBQ/oJEFg6BXDtjsaVkEpbSJs8L7AFktZelpThx5aIrB
            fTXHvpuwzPy1exne/sd4kCyB5rZ8ayGyKptZhuAPbqLF8ug69qByei9T57D2deKU
            PmirfppfZuIc4MxgaxaTr72BjOkcsGDhEoK57jJxjtLaftXFKPtz/sFZ
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kube-controller-manager.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIID7zCCAtegAwIBAgIRAKt1HYBJzaJPFtn0y2VKrnowDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMIGgMQswCQYDVQQG
            EwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxJzAlBgNVBAoTHnN5
            c3RlbTprdWJlLWNvbnRyb2xsZXItbWFuYWdlcjEgMB4GA1UECxMXS3ViZXJuZXRl
            cyBUaGUgSGFyZCBXYXkxJzAlBgNVBAMTHnN5c3RlbTprdWJlLWNvbnRyb2xsZXIt
            bWFuYWdlcjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALYCDmz961xw
            t7Ce8749aVjZibnoUmQzIV6bSzBydFv93Hba9t757TATdEzf3lsfSnmnrSp7q8LG
            ko3AGWARzwZHV2P1WJY2UPmCI4hx1yHeBM6GkmPO4eaHyrI4tbbhf4lNthlZGI5Q
            ifOnMVh1uudQg/54A7Oy752596/NeS4rBBm8t4Zc+Q2Tt0SkqQSFvRArfBQ4NeaN
            Lf1wLD+XG3dSNy0kTivBix1B3P2lyiKI+vmP++xfv+WVK1MuY6B2mnApjighWDwf
            buGIcWnyjbD+5ekxAuF8GehhLN8/a8stMkAzKEiL3tOu+aXdKMZdsWGTSsabO2ZU
            Pfn5tqYmamMCAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsG
            AQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaAFPlo6b75
            fFG8cScAAUXQMyRpwXWiMA0GCSqGSIb3DQEBCwUAA4IBAQBSNHLk0BTbYZ5v8lKv
            E4YXaSwWd/IGv00I+JljQN9sAgkcntmFICXMcAUCiw9d3wpix+/hx+xvVEkqJZTY
            FHzimhubmjZdyeb2w3lzjV40rdFlkXb+Nq7X14w2rXrE8JPhNwasjVSfertjJZqr
            axlwi5YZsJ+2EM1qhLZT3JpW0OlQQT17L+8y+evArAarqDBGPyIXv23jU98/Ed4e
            6xO/97ZqbVMB3yZ9I8JnbBSGgFU2CwHguS1YrSN0gpWZQCUHcG2G7491BS7rdwCy
            k3RSTioE5toL/itsHXcquyLpxveQlKTrKgsi0Zq6ca/FtbOTDfAsn1zHMVHYrYb3
            uN9b
            -----END CERTIFICATE-----
            EOF
            cat > ~/kube-controller-manager-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpQIBAAKCAQEAtgIObP3rXHC3sJ7zvj1pWNmJuehSZDMhXptLMHJ0W/3cdtr2
            3vntMBN0TN/eWx9KeaetKnurwsaSjcAZYBHPBkdXY/VYljZQ+YIjiHHXId4EzoaS
            Y87h5ofKsji1tuF/iU22GVkYjlCJ86cxWHW651CD/ngDs7Lvnbn3r815LisEGby3
            hlz5DZO3RKSpBIW9ECt8FDg15o0t/XAsP5cbd1I3LSROK8GLHUHc/aXKIoj6+Y/7
            7F+/5ZUrUy5joHaacCmOKCFYPB9u4YhxafKNsP7l6TEC4XwZ6GEs3z9ryy0yQDMo
            SIve0675pd0oxl2xYZNKxps7ZlQ9+fm2piZqYwIDAQABAoIBACRPxrcB9bnslwk6
            vSBAOktKo0qeyglJlie8zcRtoT9VJ23jA4u6yxJjXzmTFFaTqJUa2dZ28+6ZFVYI
            dEeRZf83rny3zyOw1Hji+NnY9HXCSK03de9JsBIBF3R1EfPZi0tGYMUv3FFQSiV9
            PsAKRO6vRpY3NW3djiammn7NfJa0Eh0Jokd6AHtO+VoTj1tw4/sBkxLV18sPBVOM
            Cydqt/MhkwImjb8KLlW6T7q5pBJW0oNaEE/0O4sbBO0i3DelM/OZrdceiAVnT1Go
            C5mbg/wt9scsndN17ydbh32/zodlTGmhWTr6S4vIkNpMAoDr2WoI5wL4h2JnfAYb
            hKboqOECgYEAz89motVkVpd2Z/sMHmrf3XWrnz3J9cqWfey7l/FBF0XzdSKZGeOC
            +r5gbfTMk2ntGEHL8aQrGbxwm6bZQc17Gvii7x0u1biPniBckvSINKyhwg+luzOW
            yjyZVrIxRE5p9DJJOmfb59bqRZSvoVufUFO038aznSKPc4I/qPi2BHMCgYEA4Dbr
            IdixNcAxnsJS6KPJApgFh4C2wpGAidXSsr4s/Y7y/ZFbLZgSIY2knH9B1If00WL+
            1/F1XmBOcNosBzS23FDnLZCWsxJtAkB4Gx9NnPuh507HCUJA0CUeu5Tv/yFeoLxU
            0MvELhUGZjPlDNT+b6mizEW20cyDcjtGUxj2dlECgYEAxLcZ+05xOx8JsQiOwkR9
            QhBfs9Az2/44U1/DfOOdsEBBZEKqFz2tAVsxwSSYe3ssO2gdfNLhEe2100IwKwAu
            Zquy4RMJALtDCHat61abkPFR9ngFdJ4zQaH3rX/k7zojRkxL0YP7QQ3Kmq9TSjWH
            K+zxLVvVLwxGKxvC01sMQk0CgYEAmpKh5XKbMOAwFTAIsmN/x28AmNsOo/JleCDW
            Ie3j3GY5dMBJ6JPnJASfUFiXDKsyB0xFPqAy9v5T9Y8jPVCFJDwONCZzDj8Msbm6
            U5BwFGKRyoJPyz1Gq3h7yHw0PGJH923+1vczZ0WNZNYv+Xm5c0eyeTsyf06L7Cub
            HtydxRECgYEAzUHsoH6wb6HINfu1oOdhRjQ7XxreUphYTBg14vXGBz8VBime1yme
            XN4JyMCDK9yrzSYS5tv5cw+DPjS0+vRIMCFKRRTT7rbgo+of1v/nlfj/0Synxqba
            sPHjTtEbK8nc/Pw86N+ZOLgZmr26OAxwucPkEFR/QvNT2fZCxloA6sQ=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kube-scheduler.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIID3TCCAsWgAwIBAgIRANsy4crZF47VZrZPxWoK7JkwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMIGOMQswCQYDVQQG
            EwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxHjAcBgNVBAoTFXN5
            c3RlbTprdWJlLXNjaGVkdWxlcjEgMB4GA1UECxMXS3ViZXJuZXRlcyBUaGUgSGFy
            ZCBXYXkxHjAcBgNVBAMTFXN5c3RlbTprdWJlLXNjaGVkdWxlcjCCASIwDQYJKoZI
            hvcNAQEBBQADggEPADCCAQoCggEBALGXpJm8DpsshNdKXJkvSbtyNMTZ1nblDwsi
            Px6m5EsunpdSmWy6Zn0cOR6ocXgjyhuARnwZXg1O/svMncOcETMpFAB5IyARDJZq
            gBxCl+fiLUP/o+nbPXkDiX3sw6vLRCu4ht9Bn9Sfh95D0UJltQ1qNkRRBm+jRpkU
            weRRSapLBHYDVPyJO0Z7DS/wPGjQkkMqMFy3LKz0eFgXMDa0e/FMlSmOSyH/UQ8E
            L0L5evpiwmtDefFzdXE19SsO+9+szphzYn78K1UASlaC3BbmwD+EFDd6zxYXpBYB
            9spODvId7Mm1Sr1xQQWagb85bLjohku3lVk/FEJ2vTh/3qjirqcCAwEAAaNgMF4w
            DgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAM
            BgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaAFPlo6b75fFG8cScAAUXQMyRpwXWiMA0G
            CSqGSIb3DQEBCwUAA4IBAQCV9/lEkdhv6nHmRbYUSYQEIYWS+2z5xzmBVdSXG7yN
            DMR/dVWeZBABdyn6DISgSp8AuadjeKvt2cJXVA342MmxCarreWz1lDUpzeqtZOCu
            sRWgDh2Gr4AWbd/4wgRkjicL8ZLDgovI4YU5GhQPpCNaGgAT9ei3pX+hyZoatez0
            fxUSXRkDdgoJdAVQrQtwEiwFmV09rJRzRJqihytxLlfMAd0e04NZk7PbVrDRg2vr
            d91LFso7BCFf+64dFDAkmsCCCinWwtFPueOj6k0WKMejtEpOstkfAp2s6a12An5b
            jk5uHQn5jTy5kDZ498d26DMJtouKU4/Z9Z+Cz/P+eUm5
            -----END CERTIFICATE-----
            EOF
            cat > ~/kube-scheduler-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpAIBAAKCAQEAsZekmbwOmyyE10pcmS9Ju3I0xNnWduUPCyI/HqbkSy6el1KZ
            bLpmfRw5HqhxeCPKG4BGfBleDU7+y8ydw5wRMykUAHkjIBEMlmqAHEKX5+ItQ/+j
            6ds9eQOJfezDq8tEK7iG30Gf1J+H3kPRQmW1DWo2RFEGb6NGmRTB5FFJqksEdgNU
            /Ik7RnsNL/A8aNCSQyowXLcsrPR4WBcwNrR78UyVKY5LIf9RDwQvQvl6+mLCa0N5
            8XN1cTX1Kw7736zOmHNifvwrVQBKVoLcFubAP4QUN3rPFhekFgH2yk4O8h3sybVK
            vXFBBZqBvzlsuOiGS7eVWT8UQna9OH/eqOKupwIDAQABAoIBADIw42o3hgFBEcIu
            2ADLJpF9c4B2+G/dyOSipygojrjY0iV+SLI79B9DzLjnbjpAEyy2kjUcjkJAoy5C
            BAx2nT3STD7d/ZlgeChCrTZPc9MrTxO6uj6robID1+Xo9lwlNH0Ox79tMpjLBYFB
            tXCIgiTqca/ZHnKKuLcm8K1wc9tWo5wKXJcZcbJrX49TMHXzU0wmLlfK+8LTNgnv
            RH6g0YkLsdggtKz/7+qoFbgMapAqQ+iG8JbwlFGkprLdbuLvuR6c9dBqGFp3zYjO
            KB4B15SKkaC8Wg+t0J49ESNy2shya1cD52qcr7EfCDEvHyxLBQsCz+i+sFD16SLP
            HlNKo/ECgYEA4GKn87xkm5Ep3733/T7KuXLALXS5fBY1kaPkWbaYAA974XEIrmb/
            tuCwBJfJ0+HLdypcVkvyUFQ6ZmX0CZAEsuqyRH23ROhtjj1fxEz3U2vHr7NlUqTo
            tpTyZqDODyFpLXnQbv36qZCj2fudYJ1hLhprlaJi1HWdkptokOPaiiMCgYEAyp02
            RkdUaEI5rnHLIvr6TXlYsz1xtnq66J+A81VUZy30RBoCr098s3AzmSe3EPzTf7x7
            bW1DSmZ4sSL6eDxFSMmBst6+mcpc8RvSnKpeI+ZrnjdR9SFTMOWE40biZ4pr4kKp
            3NizIArqa0dWRZzWzJF+7o3irOIvd0jqSR64J60CgYEAkaiZXEiMiswmAZ9BD30m
            flH2XMur6NhF+AALKQ22CDwE7+i/eO9VyjJ7MNAT7V5jBT1TaZWte+Xhbz15uIdr
            9XUTOhDd2naDP9WpiDVqTBXoL69l88snYfa4kFSMzxeiPioYWyS2BkLlioiitegU
            AKiX9C/QthiPrG8D5yJyaD8CgYBYrrkLx7rFK39twDbmZ63Y7S0KvvEfqtZWbUIW
            v5mC09VfXXchXow5Sfn7pit1jwPPnCL2AWX7kaBv/9xbdh3pPvG65c3NKIrHqaLk
            mZk842TlSldgEKcF9t/UTrlYEnkn/n+0v1CfzMdQD1hOfdhyj5hcN9QoUZPvBQYu
            3PhDvQKBgQDUQg8fJZs2QVQEURDRleetZi8fO5o4ktrfz5lnIKpy7ectlj6yMVIk
            oYj0fnlkFZqbkOTeeQS6W5nJy2QtB9DFj4cVUdOIlsHUdUrDmz+yd33Ogg31J0KP
            ThOJYLyZbTQLY7Ztzig5Zn/aO6GiHDKJ0rXXIivYvfvZAVRx1BS8Qw==
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/admin.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDxTCCAq2gAwIBAgIRALKJdEXf8WrztSEchRB+WHQwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMHcxCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTEXMBUGA1UEChMOc3lz
            dGVtOm1hc3RlcnMxIDAeBgNVBAsTF0t1YmVybmV0ZXMgVGhlIEhhcmQgV2F5MQ4w
            DAYDVQQDEwVhZG1pbjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALxP
            WtBU7m+8MgdJ5EGIrjz2WcbZeCZ017ifecy6C1s7RS1LIiunGSSLjdQh8pJfssW4
            /Wca4qKjH5YrwQOBx+3vDkA4Qg4E7x8I8YmvnQq+Uhbi7fjePm2wr6NjTeYoZTGx
            SZpGQQssUzIEKYcahPvv1HO22J79MkdWrq+DQrzjnTKoZPybBJ5R82E9T4gYvl9w
            U5K0mHzDK2mAvm7x7YvZWpJjAk8dkm8usOPzQIVSHoww5t4DLlwxOzKGgYhwoFMz
            2621DiRHuMuknK8M/QbkgkOMAoBcigTdIDCNk39ATXmq98KiNpD4S3OhnnC4Z/qC
            YE8VJc5OxNrnyivuOIkCAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQW
            MBQGCCsGAQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaA
            FPlo6b75fFG8cScAAUXQMyRpwXWiMA0GCSqGSIb3DQEBCwUAA4IBAQBkP/QU4uRS
            9aI3t/445hwh/+4cQRC3dpC6nuE8NjDLRZM/mYU/JSr/MK/I54Q0HDztas+drQv2
            ESHJ6BU/m0/oHPoIK4gERT6+GAKiq9Xpu+xHMMM8gxnR5V9MhQGIEq8jKVWjRF9l
            CS8p6+u7ZHDFMLUTwiiMKfPSvInle0Cv6l3k0fKEMyevlf2AJAy6x2AS/udARMDk
            SjY6athbzO/wDnelq1jUdUxrpgm9yRrDMhIRd4KCqY2MhhB/o4n+84podcO3xwPM
            YLkgBG3Q08Fi0YIq22TLB0QVBl4vH6aL6VSr+0jLo8tEg6Vbqry79s0p/rUfsbTm
            za6Nfd4k7b/P
            -----END CERTIFICATE-----
            EOF
            cat > ~/admin-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpQIBAAKCAQEAvE9a0FTub7wyB0nkQYiuPPZZxtl4JnTXuJ95zLoLWztFLUsi
            K6cZJIuN1CHykl+yxbj9ZxrioqMflivBA4HH7e8OQDhCDgTvHwjxia+dCr5SFuLt
            +N4+bbCvo2NN5ihlMbFJmkZBCyxTMgQphxqE++/Uc7bYnv0yR1aur4NCvOOdMqhk
            /JsEnlHzYT1PiBi+X3BTkrSYfMMraYC+bvHti9lakmMCTx2Sby6w4/NAhVIejDDm
            3gMuXDE7MoaBiHCgUzPbrbUOJEe4y6Scrwz9BuSCQ4wCgFyKBN0gMI2Tf0BNear3
            wqI2kPhLc6GecLhn+oJgTxUlzk7E2ufKK+44iQIDAQABAoIBAQCRQvm/+bRQ1zEU
            dEiy0PfvqO3KOhm4OKvsDIFNjzqRbuBHN00ttWHs0gZfXKydg1sJsVEwxwmLAiCs
            nCXxSZzri1xH5930qJO5MhH471JKZlQ2uWlvcCliPkjO1hzSbdjaA3POoWEteEzZ
            KWLLiIaLPg96D9N8mb6+TzzDwZKq1+uQRE4qAXIhXJpQNEiJ4+ovTVrz1h2JjLKM
            rAs1z+3DuOg3N0E2RSTGUbzEN70EcRcDtQMprCWmm5e/ptiB2uS6rhaLISiOKguP
            BmHE1KSOq9Eo/ZECfUBHodd4vqCeHwvhsEOMvV4IUErCnTQ+lIBWe9j/XSTx9wI8
            cEj0yF6BAoGBANSGSPjRxYsE/DFppX7he0+b8GXrUJHMgZPVyE8MNON++GWjxcbc
            jaPNgJ6/aAkD7L2QQ2/9qoeGLAyANnWrLSgfLa2WSq3AzSDc6rYhTl3wcq6wDQyx
            rNWnvzzK1lEN/2err6PWJdKWBAICa3/BUAzGfcM+d6XK+IyJRsMNMhp5AoGBAOLU
            +ZKCPz3h9Mhb0AT1fH4I87NVTR7mcp6FzqU+st+RHcNaFKZCrqoBNK+wCy16bX0d
            Ttd8Jwzbg2KvbF4JNc3yDIYaqGolFwU+htqCy2u1d0+4lu/u3tg0sms8Uux5xcLt
            MwSpBC/6DR6NaW6WfXE7E3VIXeriQVnhIRGgiIqRAoGBAKUyFHrEpCbhox7NngS4
            RF+nOQAgH6qVKou9e0xmkp3bTj3DRbLEMZ0H2liLM9T+JgFbp+/fX7SkiIzXBH4G
            pr0vLxRlZHsXCNvonNEhpobCpoI++oXJfi09jRs2F809cjAldguGJDRCw67ELsdJ
            fm3PxGYFon9O/FBRTJ3FHhMRAoGBAMtgOQRrU1igp2CdMT3A/QXj8NzxtlvmMw5+
            2nC+bpKVAiKNOcZ4MzKqMhrztJHqGxD6nh4GatzUVFC/CGKnz13/j8sNS8Mfziwd
            i7uPWeQQqBEKaApoGdWwKeiMBa2Q4QeMtRmQkPiTMgAaulU1CPPlC+U0JUDb68wy
            Vfv/+2yBAoGAZ7FBFHUMyhwH1l+pkbn2G0HZW7Af0iIcX/Ux6xwZ6BEOfiAokMgR
            Iw0wepB9/okrlXEW2O50cM9L0OxxKTUVvCCj0/yxnXNQ9U3BxmccK2N3M0mtsaNF
            11/1NDxMJkGH78wk2vWJpkOtu5yxxudKDg34AtFe+20DVbybGnSksus=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/apiserver_create_role.yaml <<EOF 
            apiVersion: rbac.authorization.k8s.io/v1beta1
            kind: ClusterRole
            metadata:
              annotations:
                rbac.authorization.kubernetes.io/autoupdate: "true"
              labels:
                kubernetes.io/bootstrapping: rbac-defaults
              name: system:kube-apiserver-to-kubelet
            rules:
              - apiGroups:
                  - ""
                resources:
                  - nodes/proxy
                  - nodes/stats
                  - nodes/log
                  - nodes/spec
                  - nodes/metrics
                verbs:
                  - "*"
            EOF
            cat > ~/apiserver_role_bind.yaml <<EOF 
            apiVersion: rbac.authorization.k8s.io/v1beta1
            kind: ClusterRoleBinding
            metadata:
              name: system:kube-apiserver
              namespace: ""
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: system:kube-apiserver-to-kubelet
            subjects:
              - apiGroup: rbac.authorization.k8s.io
                kind: User
                name: kubernetes
            EOF
            cd ~
            wget https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kubectl
            chmod +x kubectl
            mv kubectl /usr/local/bin/
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-credentials system:kube-controller-manager --client-certificate=kube-controller-manager.pem --client-key=kube-controller-manager-key.pem --embed-certs=true --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=system:kube-controller-manager --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config use-context default --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-credentials system:kube-scheduler --client-certificate=kube-scheduler.pem --client-key=kube-scheduler-key.pem --embed-certs=true --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=system:kube-scheduler --kubeconfig=kube-scheduler.kubeconfig
            kubectl config use-context default --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=admin.kubeconfig
            kubectl config set-credentials admin --client-certificate=admin.pem --client-key=admin-key.pem --embed-certs=true --kubeconfig=admin.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=admin --kubeconfig=admin.kubeconfig
            kubectl config use-context default --kubeconfig=admin.kubeconfig
            cat > encryption-config.yaml <<EOF
            kind: EncryptionConfig
            apiVersion: v1
            resources:
              - resources:
                  - secrets
                providers:
                  - aescbc:
                      keys:
                        - name: key1
                          secret: $(head -c 32 /dev/urandom | base64)
                  - identity: {}
            EOF
            wget -q --show-progress --https-only --timestamping https://github.com/etcd-io/etcd/releases/download/v3.4.10/etcd-v3.4.10-linux-amd64.tar.gz
            tar -xvf etcd-v3.4.10-linux-amd64.tar.gz
            mv etcd-v3.4.10-linux-amd64/etcd* /usr/local/bin/
            mkdir -p /etc/etcd /var/lib/etcd
            chmod 700 /var/lib/etcd
            cp ca.pem kubernetes-key.pem kubernetes.pem /etc/etcd/
            cat <<EOF | tee /etc/systemd/system/etcd.service
            Unit
            Description=etcd
            Documentation=https://github.com/coreos
            
            [Service]
            Type=notify
            ExecStart=/usr/local/bin/etcd \
              --name controller-0 \
              --cert-file=/etc/etcd/kubernetes.pem \
              --key-file=/etc/etcd/kubernetes-key.pem \
              --peer-cert-file=/etc/etcd/kubernetes.pem \
              --peer-key-file=/etc/etcd/kubernetes-key.pem \
              --trusted-ca-file=/etc/etcd/ca.pem \
              --peer-trusted-ca-file=/etc/etcd/ca.pem \
              --peer-client-cert-auth \
              --client-cert-auth \
              --initial-advertise-peer-urls https://10.240.0.10:2380 \
              --listen-peer-urls https://10.240.0.10:2380 \
              --listen-client-urls https://10.240.0.10:2379,https://127.0.0.1:2379 \
              --advertise-client-urls https://10.240.0.10:2379 \
              --initial-cluster-token etcd-cluster-0 \
          -   --initial-cluster controller-0=https://10.240.0.10:2380,controller-1=https://10.240.0.11:2380 \
          +   --initial-cluster controller-0=https://10.240.0.10:2380,controller-1=https://10.240.0.11:2380,controller-2=https://10.240.0.12:2380 \
              --initial-cluster-state new \
              --data-dir=/var/lib/etcd
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            systemctl daemon-reload
            systemctl enable etcd
            systemctl start etcd
            mkdir -p /etc/kubernetes/config
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-apiserver
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-controller-manager
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-scheduler
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kubectl
            chmod +x kube-apiserver kube-controller-manager kube-scheduler kubectl
            mv kube-apiserver kube-controller-manager kube-scheduler kubectl /usr/local/bin/
            mkdir -p /var/lib/kubernetes/
            cp ca.pem /var/lib/kubernetes/
            mv ca-key.pem kubernetes-key.pem kubernetes.pem service-account-key.pem service-account.pem service-account-key.pem service-account.pem encryption-config.yaml /var/lib/kubernetes/
            cat <<EOF | tee /etc/systemd/system/kube-apiserver.service
            [Unit]
            Description=Kubernetes API Server
            Documentation=https://github.com/kubernetes/kubernetes
            
            [Service]
            ExecStart=/usr/local/bin/kube-apiserver \
              --advertise-address=10.240.0.10 \
              --allow-privileged=true \
          -   --apiserver-count=2 \
          +   --apiserver-count=3 \
              --audit-log-maxage=30 \
              --audit-log-maxbackup=3 \
              --audit-log-maxsize=100 \
             --audit-log-path=/var/log/audit.log \
            --authorization-mode=Node,RBAC \
            --bind-address=0.0.0.0 \
            --client-ca-file=/var/lib/kubernetes/ca.pem \
            --enable-admission-plugins=NamespaceLifecycle,NodeRestriction,LimitRanger,ServiceAccount,DefaultStorageClass,ResourceQuota \
            --etcd-cafile=/var/lib/kubernetes/ca.pem \
            --etcd-certfile=/var/lib/kubernetes/kubernetes.pem \
            --etcd-keyfile=/var/lib/kubernetes/kubernetes-key.pem \
          - --etcd-servers=https://10.240.0.10:2379,https://10.240.0.11:2379 \
          + --etcd-servers=https://10.240.0.10:2379,https://10.240.0.11:2379,https://10.240.0.12:2379 \
            --event-ttl=1h \
            --encryption-provider-config=/var/lib/kubernetes/encryption-config.yaml \
            --kubelet-certificate-authority=/var/lib/kubernetes/ca.pem \
            --kubelet-client-certificate=/var/lib/kubernetes/kubernetes.pem \
            --kubelet-client-key=/var/lib/kubernetes/kubernetes-key.pem \
            --kubelet-https=true \
            --runtime-config='api/all=true' \
            --service-account-key-file=/var/lib/kubernetes/service-account.pem \
            --service-cluster-ip-range=10.32.0.0/24 \
            --service-node-port-range=30000-32767 \
            --tls-cert-file=/var/lib/kubernetes/kubernetes.pem \
            --tls-private-key-file=/var/lib/kubernetes/kubernetes-key.pem \
            --v=2
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            mv kube-controller-manager.kubeconfig /var/lib/kubernetes/
            cat <<EOF | tee /etc/systemd/system/kube-controller-manager.service
            [Unit]
            Description=Kubernetes Controller Manager
            Documentation=https://github.com/kubernetes/kubernetes
            [Service]
            ExecStart=/usr/local/bin/kube-controller-manager \
            --bind-address=0.0.0.0 \
            --cluster-cidr=10.200.0.0/16 \
            --cluster-name=kubernetes \
            --cluster-signing-cert-file=/var/lib/kubernetes/ca.pem \
            --cluster-signing-key-file=/var/lib/kubernetes/ca-key.pem \
            --kubeconfig=/var/lib/kubernetes/kube-controller-manager.kubeconfig \
            --leader-elect=true \
            --root-ca-file=/var/lib/kubernetes/ca.pem \
            --service-account-private-key-file=/var/lib/kubernetes/service-account-key.pem \
            --service-cluster-ip-range=10.32.0.0/24 \
            --use-service-account-credentials=true \
            --v=2
            Restart=on-failure
            RestartSec=5
            [Install]
            WantedBy=multi-user.target
            EOF
            mv kube-scheduler.kubeconfig /var/lib/kubernetes/
            cat <<EOF | tee /etc/kubernetes/config/kube-scheduler.yaml
            apiVersion: kubescheduler.config.k8s.io/v1alpha1
            kind: KubeSchedulerConfiguration
            clientConnection:
              kubeconfig: "/var/lib/kubernetes/kube-scheduler.kubeconfig"
            leaderElection:
              leaderElect: true
            EOF
            cat <<EOF | tee /etc/systemd/system/kube-scheduler.service
            [Unit]
            Description=Kubernetes Scheduler
            Documentation=https://github.com/kubernetes/kubernetes
            
            [Service]
            ExecStart=/usr/local/bin/kube-scheduler \
            --config=/etc/kubernetes/config/kube-scheduler.yaml \
            --v=2
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            systemctl daemon-reload
            systemctl enable kube-apiserver kube-controller-manager kube-scheduler
            systemctl start kube-apiserver kube-controller-manager kube-scheduler
            apt-get update
            apt-get install -y nginx
            cat > kubernetes.default.svc.cluster.local <<EOF
            server {
            listen      80;
            server_name kubernetes.default.svc.cluster.local;
            location /healthz {
            proxy_pass                    https://127.0.0.1:6443/healthz;
            proxy_ssl_trusted_certificate /var/lib/kubernetes/ca.pem;
             }
            }
            EOF
            mv kubernetes.default.svc.cluster.local /etc/nginx/sites-available/kubernetes.default.svc.cluster.local
            ln /etc/nginx/sites-available/kubernetes.default.svc.cluster.local /etc/nginx/sites-enabled/
            systemctl restart nginx
            systemctl restart nginx
            if [ 0 = 0 ]; then
            kubectl apply --kubeconfig admin.kubeconfig -f apiserver_create_role.yaml
            kubectl apply --kubeconfig admin.kubeconfig -f apiserver_role_bind.yaml
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://35.189.54.4:6443
            kubectl config set-credentials admin --client-certificate=admin.pem --client-key=admin-key.pem
            kubectl config set-context kubernetes-the-hard-way --cluster=kubernetes-the-hard-way --user=admin
            kubectl config use-context kubernetes-the-hard-way
            echo start sleep > sleep
            sleep 2m
            kubectl apply -f https://storage.googleapis.com/kubernetes-the-hard-way/coredns-1.7.0.yaml
            kubectl create secret generic kubernetes-the-hard-way --from-literal="mykey=mydata"
            rm sleep
            fi
            echo finished! > finished
        EOT
      + min_cpu_platform        = (known after apply)
        name                    = "controller-0"
      ~ project                 = "kube-293902" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/kube-293902/zones/australia-southeast1-a/instances/controller-0" -> (known after apply)
        tags                    = [
            "controller",
            "kubernetes-the-hard-way",
        ]
      ~ tags_fingerprint        = "VcbEPNUNsEE=" -> (known after apply)
        zone                    = "australia-southeast1-a"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/kube-293902/zones/australia-southeast1-a/disks/controller-0" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20201028" -> "ubuntu-os-cloud/ubuntu-2004-lts"
              ~ labels = {} -> (known after apply)
                size   = 200
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kube-293902/global/networks/kubernetes-the-hard-way" -> (known after apply)
            network_ip         = "10.240.0.10"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/kube-293902/regions/australia-southeast1/subnetworks/kubernetes"
          ~ subnetwork_project = "kube-293902" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.87.198.159" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      ~ service_account {
          ~ email  = "848896957875-compute@developer.gserviceaccount.com" -> (known after apply)
            scopes = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
                "https://www.googleapis.com/auth/service.management.readonly",
                "https://www.googleapis.com/auth/servicecontrol",
            ]
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

  # google_compute_instance.controller[1] must be replaced
-/+ resource "google_compute_instance" "controller" {
        can_ip_forward          = true
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/kube-293902/zones/australia-southeast1-a/instances/controller-1" -> (known after apply)
      ~ instance_id             = "5651538216164377151" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "e2-micro"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "3I0xquSiGG8=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            cat > ~/ca.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDsjCCApqgAwIBAgIRAI05MzFUTgunWEoPCinQRjYwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMGMxCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTETMBEGA1UEChMKS3Vi
            ZXJuZXRlczELMAkGA1UECxMCQ0ExEzARBgNVBAMTCkt1YmVybmV0ZXMwggEiMA0G
            CSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCl7SCQfw18s5+TPd/nm4LVsZP+uCYT
            ismhZtoTRiRRH9kxoVorSePWGtRpv31rU5RYOdY767xPJcujd8/Xe5eJOXoTnqGt
            S81iaiW3zs3SCBpzXL2jAR8mV8XAWBOUs7egtB1IECxwfNalsWnCZcA+rUGgeu0g
            8M+XCcJTSAsthZfrvN30NS02ur7dY+nTJK3wxiYsWoWOVaF9gl6pTIXncjx98V47
            JJ7QwvjL4fu1bIJXV7IpwkWum77OJXyozG1RsCwZgd4W4tjvIr1RDxBLeVdTrsuc
            tRt87SsDgAW9QUrWtKUsEgGHUtxVCq9wFsXQn1KY7cTT5kShAs7ZWEdXAgMBAAGj
            YTBfMA4GA1UdDwEB/wQEAwICJDAdBgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUH
            AwIwDwYDVR0TAQH/BAUwAwEB/zAdBgNVHQ4EFgQU+Wjpvvl8UbxxJwABRdAzJGnB
            daIwDQYJKoZIhvcNAQELBQADggEBABDhScswvvmTQTseZBKxjLrqDLtr6eH7dQ/7
            JhmbumOLSkzuAS1Pexqnjj3K9VAEqLip2ZuRTa/Sz80eodxMm6Nlrsp5IiZKMpep
            vt5yem56ND5UsiphrYlaaFgMvO61eGNdEktD746Rqk9gFBDGQZ2Rq/EI+fNMdRZ4
            KmkS86865FDsH1RSyTrQas0B3331Yc8hKffkdFEinzLAVrTKVE2zpemxVeJIu2pB
            ps0G1hmv7vh2QQ7tpTt+zVzBAfQKyeBHVRpEVhPTGY5fuKgAbUAmZQ0BGopUCbb6
            6lg/ea7Lzd6cGrnoBmKvU6eDtXr94UXMZ6AIEy/uASNlfhCy3Hs=
            -----END CERTIFICATE-----
            EOF
            cat > ~/ca-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpAIBAAKCAQEApe0gkH8NfLOfkz3f55uC1bGT/rgmE4rJoWbaE0YkUR/ZMaFa
            K0nj1hrUab99a1OUWDnWO+u8TyXLo3fP13uXiTl6E56hrUvNYmolt87N0ggac1y9
            owEfJlfFwFgTlLO3oLQdSBAscHzWpbFpwmXAPq1BoHrtIPDPlwnCU0gLLYWX67zd
            9DUtNrq+3WPp0ySt8MYmLFqFjlWhfYJeqUyF53I8ffFeOySe0ML4y+H7tWyCV1ey
            KcJFrpu+ziV8qMxtUbAsGYHeFuLY7yK9UQ8QS3lXU67LnLUbfO0rA4AFvUFK1rSl
            LBIBh1LcVQqvcBbF0J9SmO3E0+ZEoQLO2VhHVwIDAQABAoIBACf08JCbZ/4Nq3Hj
            xpWZp2oad08xvUmbdG6/u+hETd6TUtRWzMX75zfaAijtCiDcYa7VTrfjTteofF+D
            LLPxeU58Xt92pex7gpwef7LBxGK9vNDnFmu4i23KWT62dxCqLqAuf5ao/mqgRXhl
            PtindCIjytgAgjYah4MRwJAZm0d8rtlqK4fBdhJ7u7ic1RrjmLizNNeT5nmXm7gq
            aSxje90AodsLRLscZYmVoDxub+5slluj9Ikst7DTX4yv2IV8I8zTAuY7aQ7PCIC7
            vXYOl8r1dinemjSUjIkIKEbkvwsdMfQKvkApni+5sZDNdzgxfp3RVGDtO7nk+stF
            7Mfa1ZECgYEAwJ+bIUJYDllXE1wRJOTIAqB7JnGbyo6fvu/KmzUlquUnYaAOadfr
            35uGZiWkSMnTxySRjzu6P8doC0F8MK6BqcgFBAYQ+mL11lHCw65GN3evIQ+fLBop
            ArLJ2AmBoXYBT7S9Kv4pbChtZtjTzggjUt2kSd9zVoOllI2ueWLkWy0CgYEA3ITb
            OamjzF2adhFKwrrEjgvPHDu49HZAlfYt1Kre7W2aQlRhBypVH4dUGKJN+pprEpfs
            UV5TRkaIJFEj19ibQ5ptjbqkYu/YQiwl9zS9hvNu1kfgc3/Xot6hTsZDuKmLnlQU
            Dc7roJs1Ps/2g+GY00fZjPyKzbUJ4c4WJEBxbxMCgYEAvq/CNMSmw12yE9o6pplN
            XzxbbY1eOsHCZpSfr9KHPYyo1b5LRoCYYr5l6E0vO1eBrU0IRBFOqcDPwQTM2qyG
            c/ss6/TNbfH1iHtcIbcuj86Nsl7ypggnvSIdKx8OEzbsyWkVM7B0dTv4Qa44z2fD
            AE+mSfNJDMY6brtrk4NQqOkCgYATfSpizjtLtHoSNTUGQLteUmzbcevGryzGFBu4
            z+Ej2qvncM2idHtRbgRgqPd7TmpoGkUoa82wSEt/6ivgx6PxNZS5EeW1WL0kHAK+
            9kpJwvnotjGAA6xrGIHpFFyn1VQhigy7q63nY9Aw3PBMd4OqKI9xhmA+DeHxsuUC
            Dy/3QQKBgQCEvCGF6oBa3ss7FyiF+JcirUIv7ZtYXfYWqGk2YUwr8x/QmBNjARem
            gdfHfpkwSaduTcuFzZ8bWlUr2/I0gpTX5kFQ6vdNbtTXxJJQaKYXx4uKnYuBEEUd
            mrVQKZb2/OpJfxFufdwq16AD8weB1ahqE6Dx71cnDfkmKS+DWPNs7A==
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kubernetes.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIEcTCCA1mgAwIBAgIQWn/zZxpgw8N8jL3i+OmZKDANBgkqhkiG9w0BAQsFADBj
            MQswCQYDVQQGEwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxEzAR
            BgNVBAoTCkt1YmVybmV0ZXMxCzAJBgNVBAsTAkNBMRMwEQYDVQQDEwpLdWJlcm5l
            dGVzMB4XDTIwMTEwODIzMTgwOFoXDTIxMTEwODIzMTgwOFoweDELMAkGA1UEBhMC
            QVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMwEQYDVQQKEwpLdWJl
            cm5ldGVzMSAwHgYDVQQLExdLdWJlcm5ldGVzIFRoZSBIYXJkIFdheTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAKZA
            Ux8gukEg7Z5ZeYw5cxZiBJGjQBv6YPyPvAa1q6N9Dw7V0bWj4ks5ysclLiXHj8ou
            hoYKpGSH/h9wlIKZCCB/RCbprmTvM+xtzb5CUwaV6enT87WTfAnESJ0/Ag9mwoQG
            G1Eo/4Gmrd4DaBKYhLFtn9swm1sfYFDhjmBDLpreO5hPVbEYQhzkK2bi1xVxIf5O
            mA164HiZ6tXYs/s4NYUYq3IsEeiVmbApdw2kRQquCR3+7QgZmhX9AQ0EvSt+vBHQ
            EahWs1+Dvg604YmhERC4lsr0YPF50Li8ZrQ5O77XL7G1rmBc9q1VzjBoKdpPPMh1
            yfGWeb7o3J5M4Zge7K0CAwEAAaOCAQowggEGMA4GA1UdDwEB/wQEAwIFoDAdBgNV
            HSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0TAQH/BAIwADAfBgNVHSME
            GDAWgBT5aOm++XxRvHEnAAFF0DMkacF1ojCBpQYDVR0RBIGdMIGaggprdWJlcm5l
            dGVzghJrdWJlcm5ldGVzLmRlZmF1bHSCFmt1YmVybmV0ZXMuZGVmYXVsdC5zdmOC
            Hmt1YmVybmV0ZXMuZGVmYXVsdC5zdmMuY2x1c3RlcoIca3ViZXJuZXRlcy5zdmMu
            Y2x1c3Rlci5sb2NhbIcECiAAAYcEfwAAAYcEI702BIcECvAACocECvAAC4cECvAA
            DDANBgkqhkiG9w0BAQsFAAOCAQEAcSkuf61E4kgKErKEb3kB69KH4Nxj1/oMWd4V
            WE80KWE20wi1VeK4p2TD9KT6vUQhCaxKSPsH3omhWhbJlKAkzwph82ZXsJ2yuab1
            +1JIxWgjb8VIPI1dFi0T8nO6B8K1qq33HdfT/7ltpdZcv/w09sSJa+jmYlSo7RRJ
            TCqyVoQO1jKJJii4AfM0kC+74FaLdzV/TNGobWb4qvOKkKdrZYz99GDAwQL7Wxpg
            i2Oo/O0sEsy9URp4T1aA83s5kIEzNQ5LWXCkRoSPkmeQw97EB8fFS/6daEcDEup/
            3n15w/DR8y4miruUQ821kNRdRm6mUls1fD+volhd/u1uWQVvEw==
            -----END CERTIFICATE-----
            EOF
            cat > ~/kubernetes-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEowIBAAKCAQEApkBTHyC6QSDtnll5jDlzFmIEkaNAG/pg/I+8BrWro30PDtXR
            taPiSznKxyUuJcePyi6GhgqkZIf+H3CUgpkIIH9EJumuZO8z7G3NvkJTBpXp6dPz
            tZN8CcRInT8CD2bChAYbUSj/gaat3gNoEpiEsW2f2zCbWx9gUOGOYEMumt47mE9V
            sRhCHOQrZuLXFXEh/k6YDXrgeJnq1diz+zg1hRirciwR6JWZsCl3DaRFCq4JHf7t
            CBmaFf0BDQS9K368EdARqFazX4O+DrThiaERELiWyvRg8XnQuLxmtDk7vtcvsbWu
            YFz2rVXOMGgp2k88yHXJ8ZZ5vujcnkzhmB7srQIDAQABAoIBAGR+V4BmaQ+7Vsc0
            MKvZgj7Saw6ZzsPaukuQmsi3ghPmIXcHOqeAc+ai/XcZe2as1bcSHpDh1/NI3Qym
            Ia87z9TM+SZIdPlgOlO9H/PU5ZkCf42vaA6nIwBIXNhoYNdsd0IU6uhJTwFQ/qJI
            Dt3Gwdb6e/mjzRTsx2y8mzKHCaHkoErrl1zCjqB2JVszGDlwti35LnFZ/ql5sVan
            lQ4TcYPodJz1jWaWn8++m4WEWLynJaW7QEDvlhAWM/bnDkZRWDp0stfd4lf2ypLH
            7sPipGdc8Us0lnYvcWW4DHWCaOCOKLYZurzii+L0IhQGMAKKWMCoU8Y3cgKqjHrW
            u570PSUCgYEA0vJE+9VXGqqLClix8QQwhq4NF3myYca6mojVdwh17RGyzEbsTFoI
            rhrmd9oBtR10Mq4XAaJrVCxZ4zCFHv1K2vT/xVlsiAGD0jF1qR4zGC+XjclCVlZy
            XKaJWibV2Ooyqur+8fZoPadLp8kSChB9nl9nv26HgjXW8u6MbPCN5vMCgYEAycJM
            5ZuPPnirbtAWHDKhSkRCe1iN5u1Sf0Jm+JflrdpzaBz5GUlhAcw2qlA+d7Mrl9AQ
            aWiq1dCjwY356EsDevw5qzO169GjzkHY4ajKv4OyQywCvlcWD4f5/+VNAuzlIejM
            j1RiH27rxwiUWTTtbiGaD6pO9etOAP5A0V0ABd8CgYBoNopAA8ixgtmH9gOKt3Al
            ySzskRHAXkZn+/vBf6uKwDid1Nf+bGhnYyDCyzAWwwNZ2knBY/U0M2kA5UKO6cGm
            ZG1LmP8WPfFa0VZ4g1PoufJceLZOIw0Cmr+2iwMQ07rOV6Q1827SLqkgriQ8VqNI
            r4d4umk1udWEVLeJRlpEYwKBgQCxVXGHQuJ1s1RjEszMPggcIcEZby1ScvfW2QNu
            rvv2ghJ7yTN88U0talQGAH/XcAj556v1KkU1p6u3XVXxwbUubPE3ND1LJ7lFegTp
            2xVRnayac915dUvznL21GNNGpfeDhX3+4NlZ7YGZMEZL3kRuT2R9LmE2r3qhTtij
            7I0vmwKBgHCxyHVndrY20pa5XaBmoShTzDYVbmjdpkswWkxQMDLfjd3SzXa1w+Ng
            S+NuJGP4k4szn6P2x4fZaYII7Xahr9y+3KitlrZo0BO10zQr8GKp7DStN8LoJC39
            vLjUTm4Yqs/bu7Td+3oyz5FY1HfpKCHA4VJFX/fg5a2tandeRK5S
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/service-account.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDyzCCArOgAwIBAgIRALc0DxUb1Y/zZzlZszmu6lMwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMH0xCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTETMBEGA1UEChMKS3Vi
            ZXJuZXRlczEgMB4GA1UECxMXS3ViZXJuZXRlcyBUaGUgSGFyZCBXYXkxGDAWBgNV
            BAMTD3NlcnZpY2UtYWNjb3VudDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoC
            ggEBANq7uilBfSef6lVXc7qwM6VPA6ojq3ABYXx3a8NgoH3ys8UV5+3TMuaiS5iE
            pRuysKnA2LUMtbcCm+8BLptUOJYDDFmzwj3m0MSXhuv431GWtmgvuhF6NJcU35ax
            bm7zeNERP7lOr/fGQEJZLt4QD1G8UN8JD69x48QxhNsma2AxMQL68EyhHpelA6sY
            aVRns9KP6E4VHQqVyuD8xbn1ZAoFlm61pf2fDSrBB8M1y+Wx1Vg9q2qQl69JfL8G
            7odxLVwuJAGuGnUjxoN4ZOwGANMLTk0xfDD+8iSSY4T04+SXGxuZ39GMf4EnExrR
            gG2MbOwaX4ay+GDi0Cj5p270tm8CAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0G
            A1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1Ud
            IwQYMBaAFPlo6b75fFG8cScAAUXQMyRpwXWiMA0GCSqGSIb3DQEBCwUAA4IBAQA/
            nGEnJCVcmhm8R0DB/he6p46XHjAW6nV2bjJNKkmkIi7mOgl8N3IF0pM8FSRzNPDO
            MbIDNzq1wHN/p8lfqn09jSPpmQ46fLZibZriDt7wr/w87eHfJhSWF4okd/IMlrXn
            RhqT+TL+wx0wTyYCKzE0N6iUNoSU92CPEygv+iRs5qfcCYJzqnXbDN0TcU9yGCGF
            wGBMkuX1ujVRmOZKycGNThq3m/WuR34Al38m5Tv/tvj3OQGbTQnKdrOB2Pbp/7BF
            cy2QZk5xp8IBv0TJolsPdiGTHV76c/anA33DGWdijCYQMZdJ9UXO3pGzwN0JXN3L
            h5swGi64e+Mi9iTaEQ9T
            -----END CERTIFICATE-----
            EOF
            cat > ~/service-account-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpgIBAAKCAQEA2ru6KUF9J5/qVVdzurAzpU8DqiOrcAFhfHdrw2CgffKzxRXn
            7dMy5qJLmISlG7KwqcDYtQy1twKb7wEum1Q4lgMMWbPCPebQxJeG6/jfUZa2aC+6
            EXo0lxTflrFubvN40RE/uU6v98ZAQlku3hAPUbxQ3wkPr3HjxDGE2yZrYDExAvrw
            TKEel6UDqxhpVGez0o/oThUdCpXK4PzFufVkCgWWbrWl/Z8NKsEHwzXL5bHVWD2r
            apCXr0l8vwbuh3EtXC4kAa4adSPGg3hk7AYA0wtOTTF8MP7yJJJjhPTj5JcbG5nf
            0Yx/gScTGtGAbYxs7BpfhrL4YOLQKPmnbvS2bwIDAQABAoIBAQCzY+VA8rHnbpLs
            XSXQBbTFrfDueAShfrBqOTMLcNMPmJ5xVA78EQuc9ZwUQS18cufKwRu6GOtrZdtn
            gEuuHrut5GAbrX7v775mjXOdUmYs7vM4rXPn45cAFaFuYKSWoF4E8SWXH/7XsiN/
            hs8WVouJ2G1nDnJrzHclsAsrBO5pW0mYUJVrxQOl7FNux3sKAynmuAGSCZxKZTRf
            9Fmxr4U43ddsapYGpt2Qspm1tyxr7DYuuiDE67uPFL09flJJR1oxZ+/IY6E1ojGI
            dcege6sEzItAM7u6MqA69JpNRrDZSq/MuosZDpG7tVOOXTFnUI+6gjTRl4o8VftC
            zQZt67f5AoGBANxRM51rOKKn57SsCem37RnCvyP213ODNfe6ycg4ZOOscits2taP
            Of/X4+dRfuL7VRIe802wE7bZziGkc+pQQYwE69XcT6N27d4mPXnVyLcHzjFTJlPx
            GLJI4uTieR4FtBXwuBO845/VrUZcCTj6rBtVlMrzidt/P9vI5vRSrNa9AoGBAP4o
            2sC3MBqbesFS76U54ueN7DWT+esQ5TSgI8UPoW8URlulTqL6Z6RbTr0PedR7deBy
            +OUL4NWjJD3Eo8X4rgQIm+Tk8b/OgO+/kCUVTLokqys21RDHSY7mbm649aUXtJTo
            wxiz+sSFJNLxdyAg9auk5+/hVP+x723mtDjaNZqbAoGBAMSJT5ELWC+JtyIuIn2z
            DLjhSJ+tkM9D6n2+zEhnPmD3sbVZWvLyO9wmW/E7ewTDDkWnBIZ2H3ALZl4OlTUe
            OQrOTQ+vg/+flVyKImcwNehI90B7G4LgXZaVfIqQGVmV3ut/nMZGx4wLEpLkgXmp
            7KRJuP0/Oehr4KyQ0K59nh/FAoGBAKy9G6ArYRhUX+QQ+Ct14k+6V7Y6cntfKkjQ
            Jj+C1hdm0kLrYTzHr7U3EZbRc94EYyM/QQZ7Qj4w+Sq6AQ1GbQ70wu+Y4u2X7m4D
            5nYtuc4xqdxfEgSrTcU/vAKo1ttz9xnV8PNTL7ZtP4/W6T3+6LnWBIU2wsxeJPqu
            +AJD3HbNAoGBANiFVEe3KBQ/oJEFg6BXDtjsaVkEpbSJs8L7AFktZelpThx5aIrB
            fTXHvpuwzPy1exne/sd4kCyB5rZ8ayGyKptZhuAPbqLF8ug69qByei9T57D2deKU
            PmirfppfZuIc4MxgaxaTr72BjOkcsGDhEoK57jJxjtLaftXFKPtz/sFZ
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kube-controller-manager.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIID7zCCAtegAwIBAgIRAKt1HYBJzaJPFtn0y2VKrnowDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMIGgMQswCQYDVQQG
            EwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxJzAlBgNVBAoTHnN5
            c3RlbTprdWJlLWNvbnRyb2xsZXItbWFuYWdlcjEgMB4GA1UECxMXS3ViZXJuZXRl
            cyBUaGUgSGFyZCBXYXkxJzAlBgNVBAMTHnN5c3RlbTprdWJlLWNvbnRyb2xsZXIt
            bWFuYWdlcjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALYCDmz961xw
            t7Ce8749aVjZibnoUmQzIV6bSzBydFv93Hba9t757TATdEzf3lsfSnmnrSp7q8LG
            ko3AGWARzwZHV2P1WJY2UPmCI4hx1yHeBM6GkmPO4eaHyrI4tbbhf4lNthlZGI5Q
            ifOnMVh1uudQg/54A7Oy752596/NeS4rBBm8t4Zc+Q2Tt0SkqQSFvRArfBQ4NeaN
            Lf1wLD+XG3dSNy0kTivBix1B3P2lyiKI+vmP++xfv+WVK1MuY6B2mnApjighWDwf
            buGIcWnyjbD+5ekxAuF8GehhLN8/a8stMkAzKEiL3tOu+aXdKMZdsWGTSsabO2ZU
            Pfn5tqYmamMCAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsG
            AQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaAFPlo6b75
            fFG8cScAAUXQMyRpwXWiMA0GCSqGSIb3DQEBCwUAA4IBAQBSNHLk0BTbYZ5v8lKv
            E4YXaSwWd/IGv00I+JljQN9sAgkcntmFICXMcAUCiw9d3wpix+/hx+xvVEkqJZTY
            FHzimhubmjZdyeb2w3lzjV40rdFlkXb+Nq7X14w2rXrE8JPhNwasjVSfertjJZqr
            axlwi5YZsJ+2EM1qhLZT3JpW0OlQQT17L+8y+evArAarqDBGPyIXv23jU98/Ed4e
            6xO/97ZqbVMB3yZ9I8JnbBSGgFU2CwHguS1YrSN0gpWZQCUHcG2G7491BS7rdwCy
            k3RSTioE5toL/itsHXcquyLpxveQlKTrKgsi0Zq6ca/FtbOTDfAsn1zHMVHYrYb3
            uN9b
            -----END CERTIFICATE-----
            EOF
            cat > ~/kube-controller-manager-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpQIBAAKCAQEAtgIObP3rXHC3sJ7zvj1pWNmJuehSZDMhXptLMHJ0W/3cdtr2
            3vntMBN0TN/eWx9KeaetKnurwsaSjcAZYBHPBkdXY/VYljZQ+YIjiHHXId4EzoaS
            Y87h5ofKsji1tuF/iU22GVkYjlCJ86cxWHW651CD/ngDs7Lvnbn3r815LisEGby3
            hlz5DZO3RKSpBIW9ECt8FDg15o0t/XAsP5cbd1I3LSROK8GLHUHc/aXKIoj6+Y/7
            7F+/5ZUrUy5joHaacCmOKCFYPB9u4YhxafKNsP7l6TEC4XwZ6GEs3z9ryy0yQDMo
            SIve0675pd0oxl2xYZNKxps7ZlQ9+fm2piZqYwIDAQABAoIBACRPxrcB9bnslwk6
            vSBAOktKo0qeyglJlie8zcRtoT9VJ23jA4u6yxJjXzmTFFaTqJUa2dZ28+6ZFVYI
            dEeRZf83rny3zyOw1Hji+NnY9HXCSK03de9JsBIBF3R1EfPZi0tGYMUv3FFQSiV9
            PsAKRO6vRpY3NW3djiammn7NfJa0Eh0Jokd6AHtO+VoTj1tw4/sBkxLV18sPBVOM
            Cydqt/MhkwImjb8KLlW6T7q5pBJW0oNaEE/0O4sbBO0i3DelM/OZrdceiAVnT1Go
            C5mbg/wt9scsndN17ydbh32/zodlTGmhWTr6S4vIkNpMAoDr2WoI5wL4h2JnfAYb
            hKboqOECgYEAz89motVkVpd2Z/sMHmrf3XWrnz3J9cqWfey7l/FBF0XzdSKZGeOC
            +r5gbfTMk2ntGEHL8aQrGbxwm6bZQc17Gvii7x0u1biPniBckvSINKyhwg+luzOW
            yjyZVrIxRE5p9DJJOmfb59bqRZSvoVufUFO038aznSKPc4I/qPi2BHMCgYEA4Dbr
            IdixNcAxnsJS6KPJApgFh4C2wpGAidXSsr4s/Y7y/ZFbLZgSIY2knH9B1If00WL+
            1/F1XmBOcNosBzS23FDnLZCWsxJtAkB4Gx9NnPuh507HCUJA0CUeu5Tv/yFeoLxU
            0MvELhUGZjPlDNT+b6mizEW20cyDcjtGUxj2dlECgYEAxLcZ+05xOx8JsQiOwkR9
            QhBfs9Az2/44U1/DfOOdsEBBZEKqFz2tAVsxwSSYe3ssO2gdfNLhEe2100IwKwAu
            Zquy4RMJALtDCHat61abkPFR9ngFdJ4zQaH3rX/k7zojRkxL0YP7QQ3Kmq9TSjWH
            K+zxLVvVLwxGKxvC01sMQk0CgYEAmpKh5XKbMOAwFTAIsmN/x28AmNsOo/JleCDW
            Ie3j3GY5dMBJ6JPnJASfUFiXDKsyB0xFPqAy9v5T9Y8jPVCFJDwONCZzDj8Msbm6
            U5BwFGKRyoJPyz1Gq3h7yHw0PGJH923+1vczZ0WNZNYv+Xm5c0eyeTsyf06L7Cub
            HtydxRECgYEAzUHsoH6wb6HINfu1oOdhRjQ7XxreUphYTBg14vXGBz8VBime1yme
            XN4JyMCDK9yrzSYS5tv5cw+DPjS0+vRIMCFKRRTT7rbgo+of1v/nlfj/0Synxqba
            sPHjTtEbK8nc/Pw86N+ZOLgZmr26OAxwucPkEFR/QvNT2fZCxloA6sQ=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kube-scheduler.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIID3TCCAsWgAwIBAgIRANsy4crZF47VZrZPxWoK7JkwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMIGOMQswCQYDVQQG
            EwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxHjAcBgNVBAoTFXN5
            c3RlbTprdWJlLXNjaGVkdWxlcjEgMB4GA1UECxMXS3ViZXJuZXRlcyBUaGUgSGFy
            ZCBXYXkxHjAcBgNVBAMTFXN5c3RlbTprdWJlLXNjaGVkdWxlcjCCASIwDQYJKoZI
            hvcNAQEBBQADggEPADCCAQoCggEBALGXpJm8DpsshNdKXJkvSbtyNMTZ1nblDwsi
            Px6m5EsunpdSmWy6Zn0cOR6ocXgjyhuARnwZXg1O/svMncOcETMpFAB5IyARDJZq
            gBxCl+fiLUP/o+nbPXkDiX3sw6vLRCu4ht9Bn9Sfh95D0UJltQ1qNkRRBm+jRpkU
            weRRSapLBHYDVPyJO0Z7DS/wPGjQkkMqMFy3LKz0eFgXMDa0e/FMlSmOSyH/UQ8E
            L0L5evpiwmtDefFzdXE19SsO+9+szphzYn78K1UASlaC3BbmwD+EFDd6zxYXpBYB
            9spODvId7Mm1Sr1xQQWagb85bLjohku3lVk/FEJ2vTh/3qjirqcCAwEAAaNgMF4w
            DgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAM
            BgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaAFPlo6b75fFG8cScAAUXQMyRpwXWiMA0G
            CSqGSIb3DQEBCwUAA4IBAQCV9/lEkdhv6nHmRbYUSYQEIYWS+2z5xzmBVdSXG7yN
            DMR/dVWeZBABdyn6DISgSp8AuadjeKvt2cJXVA342MmxCarreWz1lDUpzeqtZOCu
            sRWgDh2Gr4AWbd/4wgRkjicL8ZLDgovI4YU5GhQPpCNaGgAT9ei3pX+hyZoatez0
            fxUSXRkDdgoJdAVQrQtwEiwFmV09rJRzRJqihytxLlfMAd0e04NZk7PbVrDRg2vr
            d91LFso7BCFf+64dFDAkmsCCCinWwtFPueOj6k0WKMejtEpOstkfAp2s6a12An5b
            jk5uHQn5jTy5kDZ498d26DMJtouKU4/Z9Z+Cz/P+eUm5
            -----END CERTIFICATE-----
            EOF
            cat > ~/kube-scheduler-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpAIBAAKCAQEAsZekmbwOmyyE10pcmS9Ju3I0xNnWduUPCyI/HqbkSy6el1KZ
            bLpmfRw5HqhxeCPKG4BGfBleDU7+y8ydw5wRMykUAHkjIBEMlmqAHEKX5+ItQ/+j
            6ds9eQOJfezDq8tEK7iG30Gf1J+H3kPRQmW1DWo2RFEGb6NGmRTB5FFJqksEdgNU
            /Ik7RnsNL/A8aNCSQyowXLcsrPR4WBcwNrR78UyVKY5LIf9RDwQvQvl6+mLCa0N5
            8XN1cTX1Kw7736zOmHNifvwrVQBKVoLcFubAP4QUN3rPFhekFgH2yk4O8h3sybVK
            vXFBBZqBvzlsuOiGS7eVWT8UQna9OH/eqOKupwIDAQABAoIBADIw42o3hgFBEcIu
            2ADLJpF9c4B2+G/dyOSipygojrjY0iV+SLI79B9DzLjnbjpAEyy2kjUcjkJAoy5C
            BAx2nT3STD7d/ZlgeChCrTZPc9MrTxO6uj6robID1+Xo9lwlNH0Ox79tMpjLBYFB
            tXCIgiTqca/ZHnKKuLcm8K1wc9tWo5wKXJcZcbJrX49TMHXzU0wmLlfK+8LTNgnv
            RH6g0YkLsdggtKz/7+qoFbgMapAqQ+iG8JbwlFGkprLdbuLvuR6c9dBqGFp3zYjO
            KB4B15SKkaC8Wg+t0J49ESNy2shya1cD52qcr7EfCDEvHyxLBQsCz+i+sFD16SLP
            HlNKo/ECgYEA4GKn87xkm5Ep3733/T7KuXLALXS5fBY1kaPkWbaYAA974XEIrmb/
            tuCwBJfJ0+HLdypcVkvyUFQ6ZmX0CZAEsuqyRH23ROhtjj1fxEz3U2vHr7NlUqTo
            tpTyZqDODyFpLXnQbv36qZCj2fudYJ1hLhprlaJi1HWdkptokOPaiiMCgYEAyp02
            RkdUaEI5rnHLIvr6TXlYsz1xtnq66J+A81VUZy30RBoCr098s3AzmSe3EPzTf7x7
            bW1DSmZ4sSL6eDxFSMmBst6+mcpc8RvSnKpeI+ZrnjdR9SFTMOWE40biZ4pr4kKp
            3NizIArqa0dWRZzWzJF+7o3irOIvd0jqSR64J60CgYEAkaiZXEiMiswmAZ9BD30m
            flH2XMur6NhF+AALKQ22CDwE7+i/eO9VyjJ7MNAT7V5jBT1TaZWte+Xhbz15uIdr
            9XUTOhDd2naDP9WpiDVqTBXoL69l88snYfa4kFSMzxeiPioYWyS2BkLlioiitegU
            AKiX9C/QthiPrG8D5yJyaD8CgYBYrrkLx7rFK39twDbmZ63Y7S0KvvEfqtZWbUIW
            v5mC09VfXXchXow5Sfn7pit1jwPPnCL2AWX7kaBv/9xbdh3pPvG65c3NKIrHqaLk
            mZk842TlSldgEKcF9t/UTrlYEnkn/n+0v1CfzMdQD1hOfdhyj5hcN9QoUZPvBQYu
            3PhDvQKBgQDUQg8fJZs2QVQEURDRleetZi8fO5o4ktrfz5lnIKpy7ectlj6yMVIk
            oYj0fnlkFZqbkOTeeQS6W5nJy2QtB9DFj4cVUdOIlsHUdUrDmz+yd33Ogg31J0KP
            ThOJYLyZbTQLY7Ztzig5Zn/aO6GiHDKJ0rXXIivYvfvZAVRx1BS8Qw==
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/admin.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDxTCCAq2gAwIBAgIRALKJdEXf8WrztSEchRB+WHQwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMHcxCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTEXMBUGA1UEChMOc3lz
            dGVtOm1hc3RlcnMxIDAeBgNVBAsTF0t1YmVybmV0ZXMgVGhlIEhhcmQgV2F5MQ4w
            DAYDVQQDEwVhZG1pbjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALxP
            WtBU7m+8MgdJ5EGIrjz2WcbZeCZ017ifecy6C1s7RS1LIiunGSSLjdQh8pJfssW4
            /Wca4qKjH5YrwQOBx+3vDkA4Qg4E7x8I8YmvnQq+Uhbi7fjePm2wr6NjTeYoZTGx
            SZpGQQssUzIEKYcahPvv1HO22J79MkdWrq+DQrzjnTKoZPybBJ5R82E9T4gYvl9w
            U5K0mHzDK2mAvm7x7YvZWpJjAk8dkm8usOPzQIVSHoww5t4DLlwxOzKGgYhwoFMz
            2621DiRHuMuknK8M/QbkgkOMAoBcigTdIDCNk39ATXmq98KiNpD4S3OhnnC4Z/qC
            YE8VJc5OxNrnyivuOIkCAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQW
            MBQGCCsGAQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaA
            FPlo6b75fFG8cScAAUXQMyRpwXWiMA0GCSqGSIb3DQEBCwUAA4IBAQBkP/QU4uRS
            9aI3t/445hwh/+4cQRC3dpC6nuE8NjDLRZM/mYU/JSr/MK/I54Q0HDztas+drQv2
            ESHJ6BU/m0/oHPoIK4gERT6+GAKiq9Xpu+xHMMM8gxnR5V9MhQGIEq8jKVWjRF9l
            CS8p6+u7ZHDFMLUTwiiMKfPSvInle0Cv6l3k0fKEMyevlf2AJAy6x2AS/udARMDk
            SjY6athbzO/wDnelq1jUdUxrpgm9yRrDMhIRd4KCqY2MhhB/o4n+84podcO3xwPM
            YLkgBG3Q08Fi0YIq22TLB0QVBl4vH6aL6VSr+0jLo8tEg6Vbqry79s0p/rUfsbTm
            za6Nfd4k7b/P
            -----END CERTIFICATE-----
            EOF
            cat > ~/admin-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpQIBAAKCAQEAvE9a0FTub7wyB0nkQYiuPPZZxtl4JnTXuJ95zLoLWztFLUsi
            K6cZJIuN1CHykl+yxbj9ZxrioqMflivBA4HH7e8OQDhCDgTvHwjxia+dCr5SFuLt
            +N4+bbCvo2NN5ihlMbFJmkZBCyxTMgQphxqE++/Uc7bYnv0yR1aur4NCvOOdMqhk
            /JsEnlHzYT1PiBi+X3BTkrSYfMMraYC+bvHti9lakmMCTx2Sby6w4/NAhVIejDDm
            3gMuXDE7MoaBiHCgUzPbrbUOJEe4y6Scrwz9BuSCQ4wCgFyKBN0gMI2Tf0BNear3
            wqI2kPhLc6GecLhn+oJgTxUlzk7E2ufKK+44iQIDAQABAoIBAQCRQvm/+bRQ1zEU
            dEiy0PfvqO3KOhm4OKvsDIFNjzqRbuBHN00ttWHs0gZfXKydg1sJsVEwxwmLAiCs
            nCXxSZzri1xH5930qJO5MhH471JKZlQ2uWlvcCliPkjO1hzSbdjaA3POoWEteEzZ
            KWLLiIaLPg96D9N8mb6+TzzDwZKq1+uQRE4qAXIhXJpQNEiJ4+ovTVrz1h2JjLKM
            rAs1z+3DuOg3N0E2RSTGUbzEN70EcRcDtQMprCWmm5e/ptiB2uS6rhaLISiOKguP
            BmHE1KSOq9Eo/ZECfUBHodd4vqCeHwvhsEOMvV4IUErCnTQ+lIBWe9j/XSTx9wI8
            cEj0yF6BAoGBANSGSPjRxYsE/DFppX7he0+b8GXrUJHMgZPVyE8MNON++GWjxcbc
            jaPNgJ6/aAkD7L2QQ2/9qoeGLAyANnWrLSgfLa2WSq3AzSDc6rYhTl3wcq6wDQyx
            rNWnvzzK1lEN/2err6PWJdKWBAICa3/BUAzGfcM+d6XK+IyJRsMNMhp5AoGBAOLU
            +ZKCPz3h9Mhb0AT1fH4I87NVTR7mcp6FzqU+st+RHcNaFKZCrqoBNK+wCy16bX0d
            Ttd8Jwzbg2KvbF4JNc3yDIYaqGolFwU+htqCy2u1d0+4lu/u3tg0sms8Uux5xcLt
            MwSpBC/6DR6NaW6WfXE7E3VIXeriQVnhIRGgiIqRAoGBAKUyFHrEpCbhox7NngS4
            RF+nOQAgH6qVKou9e0xmkp3bTj3DRbLEMZ0H2liLM9T+JgFbp+/fX7SkiIzXBH4G
            pr0vLxRlZHsXCNvonNEhpobCpoI++oXJfi09jRs2F809cjAldguGJDRCw67ELsdJ
            fm3PxGYFon9O/FBRTJ3FHhMRAoGBAMtgOQRrU1igp2CdMT3A/QXj8NzxtlvmMw5+
            2nC+bpKVAiKNOcZ4MzKqMhrztJHqGxD6nh4GatzUVFC/CGKnz13/j8sNS8Mfziwd
            i7uPWeQQqBEKaApoGdWwKeiMBa2Q4QeMtRmQkPiTMgAaulU1CPPlC+U0JUDb68wy
            Vfv/+2yBAoGAZ7FBFHUMyhwH1l+pkbn2G0HZW7Af0iIcX/Ux6xwZ6BEOfiAokMgR
            Iw0wepB9/okrlXEW2O50cM9L0OxxKTUVvCCj0/yxnXNQ9U3BxmccK2N3M0mtsaNF
            11/1NDxMJkGH78wk2vWJpkOtu5yxxudKDg34AtFe+20DVbybGnSksus=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/apiserver_create_role.yaml <<EOF 
            apiVersion: rbac.authorization.k8s.io/v1beta1
            kind: ClusterRole
            metadata:
              annotations:
                rbac.authorization.kubernetes.io/autoupdate: "true"
              labels:
                kubernetes.io/bootstrapping: rbac-defaults
              name: system:kube-apiserver-to-kubelet
            rules:
              - apiGroups:
                  - ""
                resources:
                  - nodes/proxy
                  - nodes/stats
                  - nodes/log
                  - nodes/spec
                  - nodes/metrics
                verbs:
                  - "*"
            EOF
            cat > ~/apiserver_role_bind.yaml <<EOF 
            apiVersion: rbac.authorization.k8s.io/v1beta1
            kind: ClusterRoleBinding
            metadata:
              name: system:kube-apiserver
              namespace: ""
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: system:kube-apiserver-to-kubelet
            subjects:
              - apiGroup: rbac.authorization.k8s.io
                kind: User
                name: kubernetes
            EOF
            cd ~
            wget https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kubectl
            chmod +x kubectl
            mv kubectl /usr/local/bin/
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-credentials system:kube-controller-manager --client-certificate=kube-controller-manager.pem --client-key=kube-controller-manager-key.pem --embed-certs=true --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=system:kube-controller-manager --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config use-context default --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-credentials system:kube-scheduler --client-certificate=kube-scheduler.pem --client-key=kube-scheduler-key.pem --embed-certs=true --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=system:kube-scheduler --kubeconfig=kube-scheduler.kubeconfig
            kubectl config use-context default --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=admin.kubeconfig
            kubectl config set-credentials admin --client-certificate=admin.pem --client-key=admin-key.pem --embed-certs=true --kubeconfig=admin.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=admin --kubeconfig=admin.kubeconfig
            kubectl config use-context default --kubeconfig=admin.kubeconfig
            cat > encryption-config.yaml <<EOF
            kind: EncryptionConfig
            apiVersion: v1
            resources:
              - resources:
                  - secrets
                providers:
                  - aescbc:
                      keys:
                        - name: key1
                          secret: $(head -c 32 /dev/urandom | base64)
                  - identity: {}
            EOF
            wget -q --show-progress --https-only --timestamping https://github.com/etcd-io/etcd/releases/download/v3.4.10/etcd-v3.4.10-linux-amd64.tar.gz
            tar -xvf etcd-v3.4.10-linux-amd64.tar.gz
            mv etcd-v3.4.10-linux-amd64/etcd* /usr/local/bin/
            mkdir -p /etc/etcd /var/lib/etcd
            chmod 700 /var/lib/etcd
            cp ca.pem kubernetes-key.pem kubernetes.pem /etc/etcd/
            cat <<EOF | tee /etc/systemd/system/etcd.service
            Unit
            Description=etcd
            Documentation=https://github.com/coreos
            
            [Service]
            Type=notify
            ExecStart=/usr/local/bin/etcd \
              --name controller-1 \
              --cert-file=/etc/etcd/kubernetes.pem \
              --key-file=/etc/etcd/kubernetes-key.pem \
              --peer-cert-file=/etc/etcd/kubernetes.pem \
              --peer-key-file=/etc/etcd/kubernetes-key.pem \
              --trusted-ca-file=/etc/etcd/ca.pem \
              --peer-trusted-ca-file=/etc/etcd/ca.pem \
              --peer-client-cert-auth \
              --client-cert-auth \
              --initial-advertise-peer-urls https://10.240.0.11:2380 \
              --listen-peer-urls https://10.240.0.11:2380 \
              --listen-client-urls https://10.240.0.11:2379,https://127.0.0.1:2379 \
              --advertise-client-urls https://10.240.0.11:2379 \
              --initial-cluster-token etcd-cluster-0 \
          -   --initial-cluster controller-0=https://10.240.0.10:2380,controller-1=https://10.240.0.11:2380 \
          +   --initial-cluster controller-0=https://10.240.0.10:2380,controller-1=https://10.240.0.11:2380,controller-2=https://10.240.0.12:2380 \
              --initial-cluster-state new \
              --data-dir=/var/lib/etcd
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            systemctl daemon-reload
            systemctl enable etcd
            systemctl start etcd
            mkdir -p /etc/kubernetes/config
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-apiserver
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-controller-manager
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-scheduler
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kubectl
            chmod +x kube-apiserver kube-controller-manager kube-scheduler kubectl
            mv kube-apiserver kube-controller-manager kube-scheduler kubectl /usr/local/bin/
            mkdir -p /var/lib/kubernetes/
            cp ca.pem /var/lib/kubernetes/
            mv ca-key.pem kubernetes-key.pem kubernetes.pem service-account-key.pem service-account.pem service-account-key.pem service-account.pem encryption-config.yaml /var/lib/kubernetes/
            cat <<EOF | tee /etc/systemd/system/kube-apiserver.service
            [Unit]
            Description=Kubernetes API Server
            Documentation=https://github.com/kubernetes/kubernetes
            
            [Service]
            ExecStart=/usr/local/bin/kube-apiserver \
              --advertise-address=10.240.0.11 \
              --allow-privileged=true \
          -   --apiserver-count=2 \
          +   --apiserver-count=3 \
              --audit-log-maxage=30 \
              --audit-log-maxbackup=3 \
              --audit-log-maxsize=100 \
             --audit-log-path=/var/log/audit.log \
            --authorization-mode=Node,RBAC \
            --bind-address=0.0.0.0 \
            --client-ca-file=/var/lib/kubernetes/ca.pem \
            --enable-admission-plugins=NamespaceLifecycle,NodeRestriction,LimitRanger,ServiceAccount,DefaultStorageClass,ResourceQuota \
            --etcd-cafile=/var/lib/kubernetes/ca.pem \
            --etcd-certfile=/var/lib/kubernetes/kubernetes.pem \
            --etcd-keyfile=/var/lib/kubernetes/kubernetes-key.pem \
          - --etcd-servers=https://10.240.0.10:2379,https://10.240.0.11:2379 \
          + --etcd-servers=https://10.240.0.10:2379,https://10.240.0.11:2379,https://10.240.0.12:2379 \
            --event-ttl=1h \
            --encryption-provider-config=/var/lib/kubernetes/encryption-config.yaml \
            --kubelet-certificate-authority=/var/lib/kubernetes/ca.pem \
            --kubelet-client-certificate=/var/lib/kubernetes/kubernetes.pem \
            --kubelet-client-key=/var/lib/kubernetes/kubernetes-key.pem \
            --kubelet-https=true \
            --runtime-config='api/all=true' \
            --service-account-key-file=/var/lib/kubernetes/service-account.pem \
            --service-cluster-ip-range=10.32.0.0/24 \
            --service-node-port-range=30000-32767 \
            --tls-cert-file=/var/lib/kubernetes/kubernetes.pem \
            --tls-private-key-file=/var/lib/kubernetes/kubernetes-key.pem \
            --v=2
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            mv kube-controller-manager.kubeconfig /var/lib/kubernetes/
            cat <<EOF | tee /etc/systemd/system/kube-controller-manager.service
            [Unit]
            Description=Kubernetes Controller Manager
            Documentation=https://github.com/kubernetes/kubernetes
            [Service]
            ExecStart=/usr/local/bin/kube-controller-manager \
            --bind-address=0.0.0.0 \
            --cluster-cidr=10.200.0.0/16 \
            --cluster-name=kubernetes \
            --cluster-signing-cert-file=/var/lib/kubernetes/ca.pem \
            --cluster-signing-key-file=/var/lib/kubernetes/ca-key.pem \
            --kubeconfig=/var/lib/kubernetes/kube-controller-manager.kubeconfig \
            --leader-elect=true \
            --root-ca-file=/var/lib/kubernetes/ca.pem \
            --service-account-private-key-file=/var/lib/kubernetes/service-account-key.pem \
            --service-cluster-ip-range=10.32.0.0/24 \
            --use-service-account-credentials=true \
            --v=2
            Restart=on-failure
            RestartSec=5
            [Install]
            WantedBy=multi-user.target
            EOF
            mv kube-scheduler.kubeconfig /var/lib/kubernetes/
            cat <<EOF | tee /etc/kubernetes/config/kube-scheduler.yaml
            apiVersion: kubescheduler.config.k8s.io/v1alpha1
            kind: KubeSchedulerConfiguration
            clientConnection:
              kubeconfig: "/var/lib/kubernetes/kube-scheduler.kubeconfig"
            leaderElection:
              leaderElect: true
            EOF
            cat <<EOF | tee /etc/systemd/system/kube-scheduler.service
            [Unit]
            Description=Kubernetes Scheduler
            Documentation=https://github.com/kubernetes/kubernetes
            
            [Service]
            ExecStart=/usr/local/bin/kube-scheduler \
            --config=/etc/kubernetes/config/kube-scheduler.yaml \
            --v=2
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            systemctl daemon-reload
            systemctl enable kube-apiserver kube-controller-manager kube-scheduler
            systemctl start kube-apiserver kube-controller-manager kube-scheduler
            apt-get update
            apt-get install -y nginx
            cat > kubernetes.default.svc.cluster.local <<EOF
            server {
            listen      80;
            server_name kubernetes.default.svc.cluster.local;
            location /healthz {
            proxy_pass                    https://127.0.0.1:6443/healthz;
            proxy_ssl_trusted_certificate /var/lib/kubernetes/ca.pem;
             }
            }
            EOF
            mv kubernetes.default.svc.cluster.local /etc/nginx/sites-available/kubernetes.default.svc.cluster.local
            ln /etc/nginx/sites-available/kubernetes.default.svc.cluster.local /etc/nginx/sites-enabled/
            systemctl restart nginx
            systemctl restart nginx
            if [ 1 = 0 ]; then
            kubectl apply --kubeconfig admin.kubeconfig -f apiserver_create_role.yaml
            kubectl apply --kubeconfig admin.kubeconfig -f apiserver_role_bind.yaml
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://35.189.54.4:6443
            kubectl config set-credentials admin --client-certificate=admin.pem --client-key=admin-key.pem
            kubectl config set-context kubernetes-the-hard-way --cluster=kubernetes-the-hard-way --user=admin
            kubectl config use-context kubernetes-the-hard-way
            echo start sleep > sleep
            sleep 2m
            kubectl apply -f https://storage.googleapis.com/kubernetes-the-hard-way/coredns-1.7.0.yaml
            kubectl create secret generic kubernetes-the-hard-way --from-literal="mykey=mydata"
            rm sleep
            fi
            echo finished! > finished
        EOT
      + min_cpu_platform        = (known after apply)
        name                    = "controller-1"
      ~ project                 = "kube-293902" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/kube-293902/zones/australia-southeast1-a/instances/controller-1" -> (known after apply)
        tags                    = [
            "controller",
            "kubernetes-the-hard-way",
        ]
      ~ tags_fingerprint        = "VcbEPNUNsEE=" -> (known after apply)
        zone                    = "australia-southeast1-a"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/kube-293902/zones/australia-southeast1-a/disks/controller-1" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20201028" -> "ubuntu-os-cloud/ubuntu-2004-lts"
              ~ labels = {} -> (known after apply)
                size   = 200
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kube-293902/global/networks/kubernetes-the-hard-way" -> (known after apply)
            network_ip         = "10.240.0.11"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/kube-293902/regions/australia-southeast1/subnetworks/kubernetes"
          ~ subnetwork_project = "kube-293902" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.87.208.153" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      ~ service_account {
          ~ email  = "848896957875-compute@developer.gserviceaccount.com" -> (known after apply)
            scopes = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
                "https://www.googleapis.com/auth/service.management.readonly",
                "https://www.googleapis.com/auth/servicecontrol",
            ]
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

  # google_compute_instance.controller[2] will be created
  + resource "google_compute_instance" "controller" {
      + can_ip_forward          = true
      + cpu_platform            = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-micro"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            cat > ~/ca.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDsjCCApqgAwIBAgIRAI05MzFUTgunWEoPCinQRjYwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMGMxCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTETMBEGA1UEChMKS3Vi
            ZXJuZXRlczELMAkGA1UECxMCQ0ExEzARBgNVBAMTCkt1YmVybmV0ZXMwggEiMA0G
            CSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCl7SCQfw18s5+TPd/nm4LVsZP+uCYT
            ismhZtoTRiRRH9kxoVorSePWGtRpv31rU5RYOdY767xPJcujd8/Xe5eJOXoTnqGt
            S81iaiW3zs3SCBpzXL2jAR8mV8XAWBOUs7egtB1IECxwfNalsWnCZcA+rUGgeu0g
            8M+XCcJTSAsthZfrvN30NS02ur7dY+nTJK3wxiYsWoWOVaF9gl6pTIXncjx98V47
            JJ7QwvjL4fu1bIJXV7IpwkWum77OJXyozG1RsCwZgd4W4tjvIr1RDxBLeVdTrsuc
            tRt87SsDgAW9QUrWtKUsEgGHUtxVCq9wFsXQn1KY7cTT5kShAs7ZWEdXAgMBAAGj
            YTBfMA4GA1UdDwEB/wQEAwICJDAdBgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUH
            AwIwDwYDVR0TAQH/BAUwAwEB/zAdBgNVHQ4EFgQU+Wjpvvl8UbxxJwABRdAzJGnB
            daIwDQYJKoZIhvcNAQELBQADggEBABDhScswvvmTQTseZBKxjLrqDLtr6eH7dQ/7
            JhmbumOLSkzuAS1Pexqnjj3K9VAEqLip2ZuRTa/Sz80eodxMm6Nlrsp5IiZKMpep
            vt5yem56ND5UsiphrYlaaFgMvO61eGNdEktD746Rqk9gFBDGQZ2Rq/EI+fNMdRZ4
            KmkS86865FDsH1RSyTrQas0B3331Yc8hKffkdFEinzLAVrTKVE2zpemxVeJIu2pB
            ps0G1hmv7vh2QQ7tpTt+zVzBAfQKyeBHVRpEVhPTGY5fuKgAbUAmZQ0BGopUCbb6
            6lg/ea7Lzd6cGrnoBmKvU6eDtXr94UXMZ6AIEy/uASNlfhCy3Hs=
            -----END CERTIFICATE-----
            EOF
            cat > ~/ca-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpAIBAAKCAQEApe0gkH8NfLOfkz3f55uC1bGT/rgmE4rJoWbaE0YkUR/ZMaFa
            K0nj1hrUab99a1OUWDnWO+u8TyXLo3fP13uXiTl6E56hrUvNYmolt87N0ggac1y9
            owEfJlfFwFgTlLO3oLQdSBAscHzWpbFpwmXAPq1BoHrtIPDPlwnCU0gLLYWX67zd
            9DUtNrq+3WPp0ySt8MYmLFqFjlWhfYJeqUyF53I8ffFeOySe0ML4y+H7tWyCV1ey
            KcJFrpu+ziV8qMxtUbAsGYHeFuLY7yK9UQ8QS3lXU67LnLUbfO0rA4AFvUFK1rSl
            LBIBh1LcVQqvcBbF0J9SmO3E0+ZEoQLO2VhHVwIDAQABAoIBACf08JCbZ/4Nq3Hj
            xpWZp2oad08xvUmbdG6/u+hETd6TUtRWzMX75zfaAijtCiDcYa7VTrfjTteofF+D
            LLPxeU58Xt92pex7gpwef7LBxGK9vNDnFmu4i23KWT62dxCqLqAuf5ao/mqgRXhl
            PtindCIjytgAgjYah4MRwJAZm0d8rtlqK4fBdhJ7u7ic1RrjmLizNNeT5nmXm7gq
            aSxje90AodsLRLscZYmVoDxub+5slluj9Ikst7DTX4yv2IV8I8zTAuY7aQ7PCIC7
            vXYOl8r1dinemjSUjIkIKEbkvwsdMfQKvkApni+5sZDNdzgxfp3RVGDtO7nk+stF
            7Mfa1ZECgYEAwJ+bIUJYDllXE1wRJOTIAqB7JnGbyo6fvu/KmzUlquUnYaAOadfr
            35uGZiWkSMnTxySRjzu6P8doC0F8MK6BqcgFBAYQ+mL11lHCw65GN3evIQ+fLBop
            ArLJ2AmBoXYBT7S9Kv4pbChtZtjTzggjUt2kSd9zVoOllI2ueWLkWy0CgYEA3ITb
            OamjzF2adhFKwrrEjgvPHDu49HZAlfYt1Kre7W2aQlRhBypVH4dUGKJN+pprEpfs
            UV5TRkaIJFEj19ibQ5ptjbqkYu/YQiwl9zS9hvNu1kfgc3/Xot6hTsZDuKmLnlQU
            Dc7roJs1Ps/2g+GY00fZjPyKzbUJ4c4WJEBxbxMCgYEAvq/CNMSmw12yE9o6pplN
            XzxbbY1eOsHCZpSfr9KHPYyo1b5LRoCYYr5l6E0vO1eBrU0IRBFOqcDPwQTM2qyG
            c/ss6/TNbfH1iHtcIbcuj86Nsl7ypggnvSIdKx8OEzbsyWkVM7B0dTv4Qa44z2fD
            AE+mSfNJDMY6brtrk4NQqOkCgYATfSpizjtLtHoSNTUGQLteUmzbcevGryzGFBu4
            z+Ej2qvncM2idHtRbgRgqPd7TmpoGkUoa82wSEt/6ivgx6PxNZS5EeW1WL0kHAK+
            9kpJwvnotjGAA6xrGIHpFFyn1VQhigy7q63nY9Aw3PBMd4OqKI9xhmA+DeHxsuUC
            Dy/3QQKBgQCEvCGF6oBa3ss7FyiF+JcirUIv7ZtYXfYWqGk2YUwr8x/QmBNjARem
            gdfHfpkwSaduTcuFzZ8bWlUr2/I0gpTX5kFQ6vdNbtTXxJJQaKYXx4uKnYuBEEUd
            mrVQKZb2/OpJfxFufdwq16AD8weB1ahqE6Dx71cnDfkmKS+DWPNs7A==
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kubernetes.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIEcTCCA1mgAwIBAgIQWn/zZxpgw8N8jL3i+OmZKDANBgkqhkiG9w0BAQsFADBj
            MQswCQYDVQQGEwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxEzAR
            BgNVBAoTCkt1YmVybmV0ZXMxCzAJBgNVBAsTAkNBMRMwEQYDVQQDEwpLdWJlcm5l
            dGVzMB4XDTIwMTEwODIzMTgwOFoXDTIxMTEwODIzMTgwOFoweDELMAkGA1UEBhMC
            QVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMwEQYDVQQKEwpLdWJl
            cm5ldGVzMSAwHgYDVQQLExdLdWJlcm5ldGVzIFRoZSBIYXJkIFdheTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAKZA
            Ux8gukEg7Z5ZeYw5cxZiBJGjQBv6YPyPvAa1q6N9Dw7V0bWj4ks5ysclLiXHj8ou
            hoYKpGSH/h9wlIKZCCB/RCbprmTvM+xtzb5CUwaV6enT87WTfAnESJ0/Ag9mwoQG
            G1Eo/4Gmrd4DaBKYhLFtn9swm1sfYFDhjmBDLpreO5hPVbEYQhzkK2bi1xVxIf5O
            mA164HiZ6tXYs/s4NYUYq3IsEeiVmbApdw2kRQquCR3+7QgZmhX9AQ0EvSt+vBHQ
            EahWs1+Dvg604YmhERC4lsr0YPF50Li8ZrQ5O77XL7G1rmBc9q1VzjBoKdpPPMh1
            yfGWeb7o3J5M4Zge7K0CAwEAAaOCAQowggEGMA4GA1UdDwEB/wQEAwIFoDAdBgNV
            HSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0TAQH/BAIwADAfBgNVHSME
            GDAWgBT5aOm++XxRvHEnAAFF0DMkacF1ojCBpQYDVR0RBIGdMIGaggprdWJlcm5l
            dGVzghJrdWJlcm5ldGVzLmRlZmF1bHSCFmt1YmVybmV0ZXMuZGVmYXVsdC5zdmOC
            Hmt1YmVybmV0ZXMuZGVmYXVsdC5zdmMuY2x1c3RlcoIca3ViZXJuZXRlcy5zdmMu
            Y2x1c3Rlci5sb2NhbIcECiAAAYcEfwAAAYcEI702BIcECvAACocECvAAC4cECvAA
            DDANBgkqhkiG9w0BAQsFAAOCAQEAcSkuf61E4kgKErKEb3kB69KH4Nxj1/oMWd4V
            WE80KWE20wi1VeK4p2TD9KT6vUQhCaxKSPsH3omhWhbJlKAkzwph82ZXsJ2yuab1
            +1JIxWgjb8VIPI1dFi0T8nO6B8K1qq33HdfT/7ltpdZcv/w09sSJa+jmYlSo7RRJ
            TCqyVoQO1jKJJii4AfM0kC+74FaLdzV/TNGobWb4qvOKkKdrZYz99GDAwQL7Wxpg
            i2Oo/O0sEsy9URp4T1aA83s5kIEzNQ5LWXCkRoSPkmeQw97EB8fFS/6daEcDEup/
            3n15w/DR8y4miruUQ821kNRdRm6mUls1fD+volhd/u1uWQVvEw==
            -----END CERTIFICATE-----
            EOF
            cat > ~/kubernetes-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEowIBAAKCAQEApkBTHyC6QSDtnll5jDlzFmIEkaNAG/pg/I+8BrWro30PDtXR
            taPiSznKxyUuJcePyi6GhgqkZIf+H3CUgpkIIH9EJumuZO8z7G3NvkJTBpXp6dPz
            tZN8CcRInT8CD2bChAYbUSj/gaat3gNoEpiEsW2f2zCbWx9gUOGOYEMumt47mE9V
            sRhCHOQrZuLXFXEh/k6YDXrgeJnq1diz+zg1hRirciwR6JWZsCl3DaRFCq4JHf7t
            CBmaFf0BDQS9K368EdARqFazX4O+DrThiaERELiWyvRg8XnQuLxmtDk7vtcvsbWu
            YFz2rVXOMGgp2k88yHXJ8ZZ5vujcnkzhmB7srQIDAQABAoIBAGR+V4BmaQ+7Vsc0
            MKvZgj7Saw6ZzsPaukuQmsi3ghPmIXcHOqeAc+ai/XcZe2as1bcSHpDh1/NI3Qym
            Ia87z9TM+SZIdPlgOlO9H/PU5ZkCf42vaA6nIwBIXNhoYNdsd0IU6uhJTwFQ/qJI
            Dt3Gwdb6e/mjzRTsx2y8mzKHCaHkoErrl1zCjqB2JVszGDlwti35LnFZ/ql5sVan
            lQ4TcYPodJz1jWaWn8++m4WEWLynJaW7QEDvlhAWM/bnDkZRWDp0stfd4lf2ypLH
            7sPipGdc8Us0lnYvcWW4DHWCaOCOKLYZurzii+L0IhQGMAKKWMCoU8Y3cgKqjHrW
            u570PSUCgYEA0vJE+9VXGqqLClix8QQwhq4NF3myYca6mojVdwh17RGyzEbsTFoI
            rhrmd9oBtR10Mq4XAaJrVCxZ4zCFHv1K2vT/xVlsiAGD0jF1qR4zGC+XjclCVlZy
            XKaJWibV2Ooyqur+8fZoPadLp8kSChB9nl9nv26HgjXW8u6MbPCN5vMCgYEAycJM
            5ZuPPnirbtAWHDKhSkRCe1iN5u1Sf0Jm+JflrdpzaBz5GUlhAcw2qlA+d7Mrl9AQ
            aWiq1dCjwY356EsDevw5qzO169GjzkHY4ajKv4OyQywCvlcWD4f5/+VNAuzlIejM
            j1RiH27rxwiUWTTtbiGaD6pO9etOAP5A0V0ABd8CgYBoNopAA8ixgtmH9gOKt3Al
            ySzskRHAXkZn+/vBf6uKwDid1Nf+bGhnYyDCyzAWwwNZ2knBY/U0M2kA5UKO6cGm
            ZG1LmP8WPfFa0VZ4g1PoufJceLZOIw0Cmr+2iwMQ07rOV6Q1827SLqkgriQ8VqNI
            r4d4umk1udWEVLeJRlpEYwKBgQCxVXGHQuJ1s1RjEszMPggcIcEZby1ScvfW2QNu
            rvv2ghJ7yTN88U0talQGAH/XcAj556v1KkU1p6u3XVXxwbUubPE3ND1LJ7lFegTp
            2xVRnayac915dUvznL21GNNGpfeDhX3+4NlZ7YGZMEZL3kRuT2R9LmE2r3qhTtij
            7I0vmwKBgHCxyHVndrY20pa5XaBmoShTzDYVbmjdpkswWkxQMDLfjd3SzXa1w+Ng
            S+NuJGP4k4szn6P2x4fZaYII7Xahr9y+3KitlrZo0BO10zQr8GKp7DStN8LoJC39
            vLjUTm4Yqs/bu7Td+3oyz5FY1HfpKCHA4VJFX/fg5a2tandeRK5S
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/service-account.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDyzCCArOgAwIBAgIRALc0DxUb1Y/zZzlZszmu6lMwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMH0xCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTETMBEGA1UEChMKS3Vi
            ZXJuZXRlczEgMB4GA1UECxMXS3ViZXJuZXRlcyBUaGUgSGFyZCBXYXkxGDAWBgNV
            BAMTD3NlcnZpY2UtYWNjb3VudDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoC
            ggEBANq7uilBfSef6lVXc7qwM6VPA6ojq3ABYXx3a8NgoH3ys8UV5+3TMuaiS5iE
            pRuysKnA2LUMtbcCm+8BLptUOJYDDFmzwj3m0MSXhuv431GWtmgvuhF6NJcU35ax
            bm7zeNERP7lOr/fGQEJZLt4QD1G8UN8JD69x48QxhNsma2AxMQL68EyhHpelA6sY
            aVRns9KP6E4VHQqVyuD8xbn1ZAoFlm61pf2fDSrBB8M1y+Wx1Vg9q2qQl69JfL8G
            7odxLVwuJAGuGnUjxoN4ZOwGANMLTk0xfDD+8iSSY4T04+SXGxuZ39GMf4EnExrR
            gG2MbOwaX4ay+GDi0Cj5p270tm8CAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0G
            A1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1Ud
            IwQYMBaAFPlo6b75fFG8cScAAUXQMyRpwXWiMA0GCSqGSIb3DQEBCwUAA4IBAQA/
            nGEnJCVcmhm8R0DB/he6p46XHjAW6nV2bjJNKkmkIi7mOgl8N3IF0pM8FSRzNPDO
            MbIDNzq1wHN/p8lfqn09jSPpmQ46fLZibZriDt7wr/w87eHfJhSWF4okd/IMlrXn
            RhqT+TL+wx0wTyYCKzE0N6iUNoSU92CPEygv+iRs5qfcCYJzqnXbDN0TcU9yGCGF
            wGBMkuX1ujVRmOZKycGNThq3m/WuR34Al38m5Tv/tvj3OQGbTQnKdrOB2Pbp/7BF
            cy2QZk5xp8IBv0TJolsPdiGTHV76c/anA33DGWdijCYQMZdJ9UXO3pGzwN0JXN3L
            h5swGi64e+Mi9iTaEQ9T
            -----END CERTIFICATE-----
            EOF
            cat > ~/service-account-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpgIBAAKCAQEA2ru6KUF9J5/qVVdzurAzpU8DqiOrcAFhfHdrw2CgffKzxRXn
            7dMy5qJLmISlG7KwqcDYtQy1twKb7wEum1Q4lgMMWbPCPebQxJeG6/jfUZa2aC+6
            EXo0lxTflrFubvN40RE/uU6v98ZAQlku3hAPUbxQ3wkPr3HjxDGE2yZrYDExAvrw
            TKEel6UDqxhpVGez0o/oThUdCpXK4PzFufVkCgWWbrWl/Z8NKsEHwzXL5bHVWD2r
            apCXr0l8vwbuh3EtXC4kAa4adSPGg3hk7AYA0wtOTTF8MP7yJJJjhPTj5JcbG5nf
            0Yx/gScTGtGAbYxs7BpfhrL4YOLQKPmnbvS2bwIDAQABAoIBAQCzY+VA8rHnbpLs
            XSXQBbTFrfDueAShfrBqOTMLcNMPmJ5xVA78EQuc9ZwUQS18cufKwRu6GOtrZdtn
            gEuuHrut5GAbrX7v775mjXOdUmYs7vM4rXPn45cAFaFuYKSWoF4E8SWXH/7XsiN/
            hs8WVouJ2G1nDnJrzHclsAsrBO5pW0mYUJVrxQOl7FNux3sKAynmuAGSCZxKZTRf
            9Fmxr4U43ddsapYGpt2Qspm1tyxr7DYuuiDE67uPFL09flJJR1oxZ+/IY6E1ojGI
            dcege6sEzItAM7u6MqA69JpNRrDZSq/MuosZDpG7tVOOXTFnUI+6gjTRl4o8VftC
            zQZt67f5AoGBANxRM51rOKKn57SsCem37RnCvyP213ODNfe6ycg4ZOOscits2taP
            Of/X4+dRfuL7VRIe802wE7bZziGkc+pQQYwE69XcT6N27d4mPXnVyLcHzjFTJlPx
            GLJI4uTieR4FtBXwuBO845/VrUZcCTj6rBtVlMrzidt/P9vI5vRSrNa9AoGBAP4o
            2sC3MBqbesFS76U54ueN7DWT+esQ5TSgI8UPoW8URlulTqL6Z6RbTr0PedR7deBy
            +OUL4NWjJD3Eo8X4rgQIm+Tk8b/OgO+/kCUVTLokqys21RDHSY7mbm649aUXtJTo
            wxiz+sSFJNLxdyAg9auk5+/hVP+x723mtDjaNZqbAoGBAMSJT5ELWC+JtyIuIn2z
            DLjhSJ+tkM9D6n2+zEhnPmD3sbVZWvLyO9wmW/E7ewTDDkWnBIZ2H3ALZl4OlTUe
            OQrOTQ+vg/+flVyKImcwNehI90B7G4LgXZaVfIqQGVmV3ut/nMZGx4wLEpLkgXmp
            7KRJuP0/Oehr4KyQ0K59nh/FAoGBAKy9G6ArYRhUX+QQ+Ct14k+6V7Y6cntfKkjQ
            Jj+C1hdm0kLrYTzHr7U3EZbRc94EYyM/QQZ7Qj4w+Sq6AQ1GbQ70wu+Y4u2X7m4D
            5nYtuc4xqdxfEgSrTcU/vAKo1ttz9xnV8PNTL7ZtP4/W6T3+6LnWBIU2wsxeJPqu
            +AJD3HbNAoGBANiFVEe3KBQ/oJEFg6BXDtjsaVkEpbSJs8L7AFktZelpThx5aIrB
            fTXHvpuwzPy1exne/sd4kCyB5rZ8ayGyKptZhuAPbqLF8ug69qByei9T57D2deKU
            PmirfppfZuIc4MxgaxaTr72BjOkcsGDhEoK57jJxjtLaftXFKPtz/sFZ
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kube-controller-manager.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIID7zCCAtegAwIBAgIRAKt1HYBJzaJPFtn0y2VKrnowDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMIGgMQswCQYDVQQG
            EwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxJzAlBgNVBAoTHnN5
            c3RlbTprdWJlLWNvbnRyb2xsZXItbWFuYWdlcjEgMB4GA1UECxMXS3ViZXJuZXRl
            cyBUaGUgSGFyZCBXYXkxJzAlBgNVBAMTHnN5c3RlbTprdWJlLWNvbnRyb2xsZXIt
            bWFuYWdlcjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALYCDmz961xw
            t7Ce8749aVjZibnoUmQzIV6bSzBydFv93Hba9t757TATdEzf3lsfSnmnrSp7q8LG
            ko3AGWARzwZHV2P1WJY2UPmCI4hx1yHeBM6GkmPO4eaHyrI4tbbhf4lNthlZGI5Q
            ifOnMVh1uudQg/54A7Oy752596/NeS4rBBm8t4Zc+Q2Tt0SkqQSFvRArfBQ4NeaN
            Lf1wLD+XG3dSNy0kTivBix1B3P2lyiKI+vmP++xfv+WVK1MuY6B2mnApjighWDwf
            buGIcWnyjbD+5ekxAuF8GehhLN8/a8stMkAzKEiL3tOu+aXdKMZdsWGTSsabO2ZU
            Pfn5tqYmamMCAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsG
            AQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaAFPlo6b75
            fFG8cScAAUXQMyRpwXWiMA0GCSqGSIb3DQEBCwUAA4IBAQBSNHLk0BTbYZ5v8lKv
            E4YXaSwWd/IGv00I+JljQN9sAgkcntmFICXMcAUCiw9d3wpix+/hx+xvVEkqJZTY
            FHzimhubmjZdyeb2w3lzjV40rdFlkXb+Nq7X14w2rXrE8JPhNwasjVSfertjJZqr
            axlwi5YZsJ+2EM1qhLZT3JpW0OlQQT17L+8y+evArAarqDBGPyIXv23jU98/Ed4e
            6xO/97ZqbVMB3yZ9I8JnbBSGgFU2CwHguS1YrSN0gpWZQCUHcG2G7491BS7rdwCy
            k3RSTioE5toL/itsHXcquyLpxveQlKTrKgsi0Zq6ca/FtbOTDfAsn1zHMVHYrYb3
            uN9b
            -----END CERTIFICATE-----
            EOF
            cat > ~/kube-controller-manager-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpQIBAAKCAQEAtgIObP3rXHC3sJ7zvj1pWNmJuehSZDMhXptLMHJ0W/3cdtr2
            3vntMBN0TN/eWx9KeaetKnurwsaSjcAZYBHPBkdXY/VYljZQ+YIjiHHXId4EzoaS
            Y87h5ofKsji1tuF/iU22GVkYjlCJ86cxWHW651CD/ngDs7Lvnbn3r815LisEGby3
            hlz5DZO3RKSpBIW9ECt8FDg15o0t/XAsP5cbd1I3LSROK8GLHUHc/aXKIoj6+Y/7
            7F+/5ZUrUy5joHaacCmOKCFYPB9u4YhxafKNsP7l6TEC4XwZ6GEs3z9ryy0yQDMo
            SIve0675pd0oxl2xYZNKxps7ZlQ9+fm2piZqYwIDAQABAoIBACRPxrcB9bnslwk6
            vSBAOktKo0qeyglJlie8zcRtoT9VJ23jA4u6yxJjXzmTFFaTqJUa2dZ28+6ZFVYI
            dEeRZf83rny3zyOw1Hji+NnY9HXCSK03de9JsBIBF3R1EfPZi0tGYMUv3FFQSiV9
            PsAKRO6vRpY3NW3djiammn7NfJa0Eh0Jokd6AHtO+VoTj1tw4/sBkxLV18sPBVOM
            Cydqt/MhkwImjb8KLlW6T7q5pBJW0oNaEE/0O4sbBO0i3DelM/OZrdceiAVnT1Go
            C5mbg/wt9scsndN17ydbh32/zodlTGmhWTr6S4vIkNpMAoDr2WoI5wL4h2JnfAYb
            hKboqOECgYEAz89motVkVpd2Z/sMHmrf3XWrnz3J9cqWfey7l/FBF0XzdSKZGeOC
            +r5gbfTMk2ntGEHL8aQrGbxwm6bZQc17Gvii7x0u1biPniBckvSINKyhwg+luzOW
            yjyZVrIxRE5p9DJJOmfb59bqRZSvoVufUFO038aznSKPc4I/qPi2BHMCgYEA4Dbr
            IdixNcAxnsJS6KPJApgFh4C2wpGAidXSsr4s/Y7y/ZFbLZgSIY2knH9B1If00WL+
            1/F1XmBOcNosBzS23FDnLZCWsxJtAkB4Gx9NnPuh507HCUJA0CUeu5Tv/yFeoLxU
            0MvELhUGZjPlDNT+b6mizEW20cyDcjtGUxj2dlECgYEAxLcZ+05xOx8JsQiOwkR9
            QhBfs9Az2/44U1/DfOOdsEBBZEKqFz2tAVsxwSSYe3ssO2gdfNLhEe2100IwKwAu
            Zquy4RMJALtDCHat61abkPFR9ngFdJ4zQaH3rX/k7zojRkxL0YP7QQ3Kmq9TSjWH
            K+zxLVvVLwxGKxvC01sMQk0CgYEAmpKh5XKbMOAwFTAIsmN/x28AmNsOo/JleCDW
            Ie3j3GY5dMBJ6JPnJASfUFiXDKsyB0xFPqAy9v5T9Y8jPVCFJDwONCZzDj8Msbm6
            U5BwFGKRyoJPyz1Gq3h7yHw0PGJH923+1vczZ0WNZNYv+Xm5c0eyeTsyf06L7Cub
            HtydxRECgYEAzUHsoH6wb6HINfu1oOdhRjQ7XxreUphYTBg14vXGBz8VBime1yme
            XN4JyMCDK9yrzSYS5tv5cw+DPjS0+vRIMCFKRRTT7rbgo+of1v/nlfj/0Synxqba
            sPHjTtEbK8nc/Pw86N+ZOLgZmr26OAxwucPkEFR/QvNT2fZCxloA6sQ=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/kube-scheduler.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIID3TCCAsWgAwIBAgIRANsy4crZF47VZrZPxWoK7JkwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMIGOMQswCQYDVQQG
            EwJBVTEMMAoGA1UECBMDTlNXMQ8wDQYDVQQHEwZTeWRuZXkxHjAcBgNVBAoTFXN5
            c3RlbTprdWJlLXNjaGVkdWxlcjEgMB4GA1UECxMXS3ViZXJuZXRlcyBUaGUgSGFy
            ZCBXYXkxHjAcBgNVBAMTFXN5c3RlbTprdWJlLXNjaGVkdWxlcjCCASIwDQYJKoZI
            hvcNAQEBBQADggEPADCCAQoCggEBALGXpJm8DpsshNdKXJkvSbtyNMTZ1nblDwsi
            Px6m5EsunpdSmWy6Zn0cOR6ocXgjyhuARnwZXg1O/svMncOcETMpFAB5IyARDJZq
            gBxCl+fiLUP/o+nbPXkDiX3sw6vLRCu4ht9Bn9Sfh95D0UJltQ1qNkRRBm+jRpkU
            weRRSapLBHYDVPyJO0Z7DS/wPGjQkkMqMFy3LKz0eFgXMDa0e/FMlSmOSyH/UQ8E
            L0L5evpiwmtDefFzdXE19SsO+9+szphzYn78K1UASlaC3BbmwD+EFDd6zxYXpBYB
            9spODvId7Mm1Sr1xQQWagb85bLjohku3lVk/FEJ2vTh/3qjirqcCAwEAAaNgMF4w
            DgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAM
            BgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaAFPlo6b75fFG8cScAAUXQMyRpwXWiMA0G
            CSqGSIb3DQEBCwUAA4IBAQCV9/lEkdhv6nHmRbYUSYQEIYWS+2z5xzmBVdSXG7yN
            DMR/dVWeZBABdyn6DISgSp8AuadjeKvt2cJXVA342MmxCarreWz1lDUpzeqtZOCu
            sRWgDh2Gr4AWbd/4wgRkjicL8ZLDgovI4YU5GhQPpCNaGgAT9ei3pX+hyZoatez0
            fxUSXRkDdgoJdAVQrQtwEiwFmV09rJRzRJqihytxLlfMAd0e04NZk7PbVrDRg2vr
            d91LFso7BCFf+64dFDAkmsCCCinWwtFPueOj6k0WKMejtEpOstkfAp2s6a12An5b
            jk5uHQn5jTy5kDZ498d26DMJtouKU4/Z9Z+Cz/P+eUm5
            -----END CERTIFICATE-----
            EOF
            cat > ~/kube-scheduler-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpAIBAAKCAQEAsZekmbwOmyyE10pcmS9Ju3I0xNnWduUPCyI/HqbkSy6el1KZ
            bLpmfRw5HqhxeCPKG4BGfBleDU7+y8ydw5wRMykUAHkjIBEMlmqAHEKX5+ItQ/+j
            6ds9eQOJfezDq8tEK7iG30Gf1J+H3kPRQmW1DWo2RFEGb6NGmRTB5FFJqksEdgNU
            /Ik7RnsNL/A8aNCSQyowXLcsrPR4WBcwNrR78UyVKY5LIf9RDwQvQvl6+mLCa0N5
            8XN1cTX1Kw7736zOmHNifvwrVQBKVoLcFubAP4QUN3rPFhekFgH2yk4O8h3sybVK
            vXFBBZqBvzlsuOiGS7eVWT8UQna9OH/eqOKupwIDAQABAoIBADIw42o3hgFBEcIu
            2ADLJpF9c4B2+G/dyOSipygojrjY0iV+SLI79B9DzLjnbjpAEyy2kjUcjkJAoy5C
            BAx2nT3STD7d/ZlgeChCrTZPc9MrTxO6uj6robID1+Xo9lwlNH0Ox79tMpjLBYFB
            tXCIgiTqca/ZHnKKuLcm8K1wc9tWo5wKXJcZcbJrX49TMHXzU0wmLlfK+8LTNgnv
            RH6g0YkLsdggtKz/7+qoFbgMapAqQ+iG8JbwlFGkprLdbuLvuR6c9dBqGFp3zYjO
            KB4B15SKkaC8Wg+t0J49ESNy2shya1cD52qcr7EfCDEvHyxLBQsCz+i+sFD16SLP
            HlNKo/ECgYEA4GKn87xkm5Ep3733/T7KuXLALXS5fBY1kaPkWbaYAA974XEIrmb/
            tuCwBJfJ0+HLdypcVkvyUFQ6ZmX0CZAEsuqyRH23ROhtjj1fxEz3U2vHr7NlUqTo
            tpTyZqDODyFpLXnQbv36qZCj2fudYJ1hLhprlaJi1HWdkptokOPaiiMCgYEAyp02
            RkdUaEI5rnHLIvr6TXlYsz1xtnq66J+A81VUZy30RBoCr098s3AzmSe3EPzTf7x7
            bW1DSmZ4sSL6eDxFSMmBst6+mcpc8RvSnKpeI+ZrnjdR9SFTMOWE40biZ4pr4kKp
            3NizIArqa0dWRZzWzJF+7o3irOIvd0jqSR64J60CgYEAkaiZXEiMiswmAZ9BD30m
            flH2XMur6NhF+AALKQ22CDwE7+i/eO9VyjJ7MNAT7V5jBT1TaZWte+Xhbz15uIdr
            9XUTOhDd2naDP9WpiDVqTBXoL69l88snYfa4kFSMzxeiPioYWyS2BkLlioiitegU
            AKiX9C/QthiPrG8D5yJyaD8CgYBYrrkLx7rFK39twDbmZ63Y7S0KvvEfqtZWbUIW
            v5mC09VfXXchXow5Sfn7pit1jwPPnCL2AWX7kaBv/9xbdh3pPvG65c3NKIrHqaLk
            mZk842TlSldgEKcF9t/UTrlYEnkn/n+0v1CfzMdQD1hOfdhyj5hcN9QoUZPvBQYu
            3PhDvQKBgQDUQg8fJZs2QVQEURDRleetZi8fO5o4ktrfz5lnIKpy7ectlj6yMVIk
            oYj0fnlkFZqbkOTeeQS6W5nJy2QtB9DFj4cVUdOIlsHUdUrDmz+yd33Ogg31J0KP
            ThOJYLyZbTQLY7Ztzig5Zn/aO6GiHDKJ0rXXIivYvfvZAVRx1BS8Qw==
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/admin.pem <<EOF 
            -----BEGIN CERTIFICATE-----
            MIIDxTCCAq2gAwIBAgIRALKJdEXf8WrztSEchRB+WHQwDQYJKoZIhvcNAQELBQAw
            YzELMAkGA1UEBhMCQVUxDDAKBgNVBAgTA05TVzEPMA0GA1UEBxMGU3lkbmV5MRMw
            EQYDVQQKEwpLdWJlcm5ldGVzMQswCQYDVQQLEwJDQTETMBEGA1UEAxMKS3ViZXJu
            ZXRlczAeFw0yMDExMDgyMzE4MDNaFw0yMTExMDgyMzE4MDNaMHcxCzAJBgNVBAYT
            AkFVMQwwCgYDVQQIEwNOU1cxDzANBgNVBAcTBlN5ZG5leTEXMBUGA1UEChMOc3lz
            dGVtOm1hc3RlcnMxIDAeBgNVBAsTF0t1YmVybmV0ZXMgVGhlIEhhcmQgV2F5MQ4w
            DAYDVQQDEwVhZG1pbjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALxP
            WtBU7m+8MgdJ5EGIrjz2WcbZeCZ017ifecy6C1s7RS1LIiunGSSLjdQh8pJfssW4
            /Wca4qKjH5YrwQOBx+3vDkA4Qg4E7x8I8YmvnQq+Uhbi7fjePm2wr6NjTeYoZTGx
            SZpGQQssUzIEKYcahPvv1HO22J79MkdWrq+DQrzjnTKoZPybBJ5R82E9T4gYvl9w
            U5K0mHzDK2mAvm7x7YvZWpJjAk8dkm8usOPzQIVSHoww5t4DLlwxOzKGgYhwoFMz
            2621DiRHuMuknK8M/QbkgkOMAoBcigTdIDCNk39ATXmq98KiNpD4S3OhnnC4Z/qC
            YE8VJc5OxNrnyivuOIkCAwEAAaNgMF4wDgYDVR0PAQH/BAQDAgWgMB0GA1UdJQQW
            MBQGCCsGAQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB8GA1UdIwQYMBaA
            FPlo6b75fFG8cScAAUXQMyRpwXWiMA0GCSqGSIb3DQEBCwUAA4IBAQBkP/QU4uRS
            9aI3t/445hwh/+4cQRC3dpC6nuE8NjDLRZM/mYU/JSr/MK/I54Q0HDztas+drQv2
            ESHJ6BU/m0/oHPoIK4gERT6+GAKiq9Xpu+xHMMM8gxnR5V9MhQGIEq8jKVWjRF9l
            CS8p6+u7ZHDFMLUTwiiMKfPSvInle0Cv6l3k0fKEMyevlf2AJAy6x2AS/udARMDk
            SjY6athbzO/wDnelq1jUdUxrpgm9yRrDMhIRd4KCqY2MhhB/o4n+84podcO3xwPM
            YLkgBG3Q08Fi0YIq22TLB0QVBl4vH6aL6VSr+0jLo8tEg6Vbqry79s0p/rUfsbTm
            za6Nfd4k7b/P
            -----END CERTIFICATE-----
            EOF
            cat > ~/admin-key.pem <<EOF 
            -----BEGIN RSA PRIVATE KEY-----
            MIIEpQIBAAKCAQEAvE9a0FTub7wyB0nkQYiuPPZZxtl4JnTXuJ95zLoLWztFLUsi
            K6cZJIuN1CHykl+yxbj9ZxrioqMflivBA4HH7e8OQDhCDgTvHwjxia+dCr5SFuLt
            +N4+bbCvo2NN5ihlMbFJmkZBCyxTMgQphxqE++/Uc7bYnv0yR1aur4NCvOOdMqhk
            /JsEnlHzYT1PiBi+X3BTkrSYfMMraYC+bvHti9lakmMCTx2Sby6w4/NAhVIejDDm
            3gMuXDE7MoaBiHCgUzPbrbUOJEe4y6Scrwz9BuSCQ4wCgFyKBN0gMI2Tf0BNear3
            wqI2kPhLc6GecLhn+oJgTxUlzk7E2ufKK+44iQIDAQABAoIBAQCRQvm/+bRQ1zEU
            dEiy0PfvqO3KOhm4OKvsDIFNjzqRbuBHN00ttWHs0gZfXKydg1sJsVEwxwmLAiCs
            nCXxSZzri1xH5930qJO5MhH471JKZlQ2uWlvcCliPkjO1hzSbdjaA3POoWEteEzZ
            KWLLiIaLPg96D9N8mb6+TzzDwZKq1+uQRE4qAXIhXJpQNEiJ4+ovTVrz1h2JjLKM
            rAs1z+3DuOg3N0E2RSTGUbzEN70EcRcDtQMprCWmm5e/ptiB2uS6rhaLISiOKguP
            BmHE1KSOq9Eo/ZECfUBHodd4vqCeHwvhsEOMvV4IUErCnTQ+lIBWe9j/XSTx9wI8
            cEj0yF6BAoGBANSGSPjRxYsE/DFppX7he0+b8GXrUJHMgZPVyE8MNON++GWjxcbc
            jaPNgJ6/aAkD7L2QQ2/9qoeGLAyANnWrLSgfLa2WSq3AzSDc6rYhTl3wcq6wDQyx
            rNWnvzzK1lEN/2err6PWJdKWBAICa3/BUAzGfcM+d6XK+IyJRsMNMhp5AoGBAOLU
            +ZKCPz3h9Mhb0AT1fH4I87NVTR7mcp6FzqU+st+RHcNaFKZCrqoBNK+wCy16bX0d
            Ttd8Jwzbg2KvbF4JNc3yDIYaqGolFwU+htqCy2u1d0+4lu/u3tg0sms8Uux5xcLt
            MwSpBC/6DR6NaW6WfXE7E3VIXeriQVnhIRGgiIqRAoGBAKUyFHrEpCbhox7NngS4
            RF+nOQAgH6qVKou9e0xmkp3bTj3DRbLEMZ0H2liLM9T+JgFbp+/fX7SkiIzXBH4G
            pr0vLxRlZHsXCNvonNEhpobCpoI++oXJfi09jRs2F809cjAldguGJDRCw67ELsdJ
            fm3PxGYFon9O/FBRTJ3FHhMRAoGBAMtgOQRrU1igp2CdMT3A/QXj8NzxtlvmMw5+
            2nC+bpKVAiKNOcZ4MzKqMhrztJHqGxD6nh4GatzUVFC/CGKnz13/j8sNS8Mfziwd
            i7uPWeQQqBEKaApoGdWwKeiMBa2Q4QeMtRmQkPiTMgAaulU1CPPlC+U0JUDb68wy
            Vfv/+2yBAoGAZ7FBFHUMyhwH1l+pkbn2G0HZW7Af0iIcX/Ux6xwZ6BEOfiAokMgR
            Iw0wepB9/okrlXEW2O50cM9L0OxxKTUVvCCj0/yxnXNQ9U3BxmccK2N3M0mtsaNF
            11/1NDxMJkGH78wk2vWJpkOtu5yxxudKDg34AtFe+20DVbybGnSksus=
            -----END RSA PRIVATE KEY-----
            EOF
            cat > ~/apiserver_create_role.yaml <<EOF 
            apiVersion: rbac.authorization.k8s.io/v1beta1
            kind: ClusterRole
            metadata:
              annotations:
                rbac.authorization.kubernetes.io/autoupdate: "true"
              labels:
                kubernetes.io/bootstrapping: rbac-defaults
              name: system:kube-apiserver-to-kubelet
            rules:
              - apiGroups:
                  - ""
                resources:
                  - nodes/proxy
                  - nodes/stats
                  - nodes/log
                  - nodes/spec
                  - nodes/metrics
                verbs:
                  - "*"
            EOF
            cat > ~/apiserver_role_bind.yaml <<EOF 
            apiVersion: rbac.authorization.k8s.io/v1beta1
            kind: ClusterRoleBinding
            metadata:
              name: system:kube-apiserver
              namespace: ""
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: system:kube-apiserver-to-kubelet
            subjects:
              - apiGroup: rbac.authorization.k8s.io
                kind: User
                name: kubernetes
            EOF
            cd ~
            wget https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kubectl
            chmod +x kubectl
            mv kubectl /usr/local/bin/
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-credentials system:kube-controller-manager --client-certificate=kube-controller-manager.pem --client-key=kube-controller-manager-key.pem --embed-certs=true --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=system:kube-controller-manager --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config use-context default --kubeconfig=kube-controller-manager.kubeconfig
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-credentials system:kube-scheduler --client-certificate=kube-scheduler.pem --client-key=kube-scheduler-key.pem --embed-certs=true --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=system:kube-scheduler --kubeconfig=kube-scheduler.kubeconfig
            kubectl config use-context default --kubeconfig=kube-scheduler.kubeconfig
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://127.0.0.1:6443 --kubeconfig=admin.kubeconfig
            kubectl config set-credentials admin --client-certificate=admin.pem --client-key=admin-key.pem --embed-certs=true --kubeconfig=admin.kubeconfig
            kubectl config set-context default --cluster=kubernetes-the-hard-way --user=admin --kubeconfig=admin.kubeconfig
            kubectl config use-context default --kubeconfig=admin.kubeconfig
            cat > encryption-config.yaml <<EOF
            kind: EncryptionConfig
            apiVersion: v1
            resources:
              - resources:
                  - secrets
                providers:
                  - aescbc:
                      keys:
                        - name: key1
                          secret: $(head -c 32 /dev/urandom | base64)
                  - identity: {}
            EOF
            wget -q --show-progress --https-only --timestamping https://github.com/etcd-io/etcd/releases/download/v3.4.10/etcd-v3.4.10-linux-amd64.tar.gz
            tar -xvf etcd-v3.4.10-linux-amd64.tar.gz
            mv etcd-v3.4.10-linux-amd64/etcd* /usr/local/bin/
            mkdir -p /etc/etcd /var/lib/etcd
            chmod 700 /var/lib/etcd
            cp ca.pem kubernetes-key.pem kubernetes.pem /etc/etcd/
            cat <<EOF | tee /etc/systemd/system/etcd.service
            Unit
            Description=etcd
            Documentation=https://github.com/coreos
            
            [Service]
            Type=notify
            ExecStart=/usr/local/bin/etcd \
              --name controller-2 \
              --cert-file=/etc/etcd/kubernetes.pem \
              --key-file=/etc/etcd/kubernetes-key.pem \
              --peer-cert-file=/etc/etcd/kubernetes.pem \
              --peer-key-file=/etc/etcd/kubernetes-key.pem \
              --trusted-ca-file=/etc/etcd/ca.pem \
              --peer-trusted-ca-file=/etc/etcd/ca.pem \
              --peer-client-cert-auth \
              --client-cert-auth \
              --initial-advertise-peer-urls https://10.240.0.12:2380 \
              --listen-peer-urls https://10.240.0.12:2380 \
              --listen-client-urls https://10.240.0.12:2379,https://127.0.0.1:2379 \
              --advertise-client-urls https://10.240.0.12:2379 \
              --initial-cluster-token etcd-cluster-0 \
              --initial-cluster controller-0=https://10.240.0.10:2380,controller-1=https://10.240.0.11:2380,controller-2=https://10.240.0.12:2380 \
              --initial-cluster-state new \
              --data-dir=/var/lib/etcd
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            systemctl daemon-reload
            systemctl enable etcd
            systemctl start etcd
            mkdir -p /etc/kubernetes/config
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-apiserver
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-controller-manager
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kube-scheduler
            wget -q --show-progress --https-only --timestamping https://storage.googleapis.com/kubernetes-release/release/v1.18.6/bin/linux/amd64/kubectl
            chmod +x kube-apiserver kube-controller-manager kube-scheduler kubectl
            mv kube-apiserver kube-controller-manager kube-scheduler kubectl /usr/local/bin/
            mkdir -p /var/lib/kubernetes/
            cp ca.pem /var/lib/kubernetes/
            mv ca-key.pem kubernetes-key.pem kubernetes.pem service-account-key.pem service-account.pem service-account-key.pem service-account.pem encryption-config.yaml /var/lib/kubernetes/
            cat <<EOF | tee /etc/systemd/system/kube-apiserver.service
            [Unit]
            Description=Kubernetes API Server
            Documentation=https://github.com/kubernetes/kubernetes
            
            [Service]
            ExecStart=/usr/local/bin/kube-apiserver \
              --advertise-address=10.240.0.12 \
              --allow-privileged=true \
              --apiserver-count=3 \
              --audit-log-maxage=30 \
              --audit-log-maxbackup=3 \
              --audit-log-maxsize=100 \
             --audit-log-path=/var/log/audit.log \
            --authorization-mode=Node,RBAC \
            --bind-address=0.0.0.0 \
            --client-ca-file=/var/lib/kubernetes/ca.pem \
            --enable-admission-plugins=NamespaceLifecycle,NodeRestriction,LimitRanger,ServiceAccount,DefaultStorageClass,ResourceQuota \
            --etcd-cafile=/var/lib/kubernetes/ca.pem \
            --etcd-certfile=/var/lib/kubernetes/kubernetes.pem \
            --etcd-keyfile=/var/lib/kubernetes/kubernetes-key.pem \
            --etcd-servers=https://10.240.0.10:2379,https://10.240.0.11:2379,https://10.240.0.12:2379 \
            --event-ttl=1h \
            --encryption-provider-config=/var/lib/kubernetes/encryption-config.yaml \
            --kubelet-certificate-authority=/var/lib/kubernetes/ca.pem \
            --kubelet-client-certificate=/var/lib/kubernetes/kubernetes.pem \
            --kubelet-client-key=/var/lib/kubernetes/kubernetes-key.pem \
            --kubelet-https=true \
            --runtime-config='api/all=true' \
            --service-account-key-file=/var/lib/kubernetes/service-account.pem \
            --service-cluster-ip-range=10.32.0.0/24 \
            --service-node-port-range=30000-32767 \
            --tls-cert-file=/var/lib/kubernetes/kubernetes.pem \
            --tls-private-key-file=/var/lib/kubernetes/kubernetes-key.pem \
            --v=2
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            mv kube-controller-manager.kubeconfig /var/lib/kubernetes/
            cat <<EOF | tee /etc/systemd/system/kube-controller-manager.service
            [Unit]
            Description=Kubernetes Controller Manager
            Documentation=https://github.com/kubernetes/kubernetes
            [Service]
            ExecStart=/usr/local/bin/kube-controller-manager \
            --bind-address=0.0.0.0 \
            --cluster-cidr=10.200.0.0/16 \
            --cluster-name=kubernetes \
            --cluster-signing-cert-file=/var/lib/kubernetes/ca.pem \
            --cluster-signing-key-file=/var/lib/kubernetes/ca-key.pem \
            --kubeconfig=/var/lib/kubernetes/kube-controller-manager.kubeconfig \
            --leader-elect=true \
            --root-ca-file=/var/lib/kubernetes/ca.pem \
            --service-account-private-key-file=/var/lib/kubernetes/service-account-key.pem \
            --service-cluster-ip-range=10.32.0.0/24 \
            --use-service-account-credentials=true \
            --v=2
            Restart=on-failure
            RestartSec=5
            [Install]
            WantedBy=multi-user.target
            EOF
            mv kube-scheduler.kubeconfig /var/lib/kubernetes/
            cat <<EOF | tee /etc/kubernetes/config/kube-scheduler.yaml
            apiVersion: kubescheduler.config.k8s.io/v1alpha1
            kind: KubeSchedulerConfiguration
            clientConnection:
              kubeconfig: "/var/lib/kubernetes/kube-scheduler.kubeconfig"
            leaderElection:
              leaderElect: true
            EOF
            cat <<EOF | tee /etc/systemd/system/kube-scheduler.service
            [Unit]
            Description=Kubernetes Scheduler
            Documentation=https://github.com/kubernetes/kubernetes
            
            [Service]
            ExecStart=/usr/local/bin/kube-scheduler \
            --config=/etc/kubernetes/config/kube-scheduler.yaml \
            --v=2
            Restart=on-failure
            RestartSec=5
            
            [Install]
            WantedBy=multi-user.target
            EOF
            systemctl daemon-reload
            systemctl enable kube-apiserver kube-controller-manager kube-scheduler
            systemctl start kube-apiserver kube-controller-manager kube-scheduler
            apt-get update
            apt-get install -y nginx
            cat > kubernetes.default.svc.cluster.local <<EOF
            server {
            listen      80;
            server_name kubernetes.default.svc.cluster.local;
            location /healthz {
            proxy_pass                    https://127.0.0.1:6443/healthz;
            proxy_ssl_trusted_certificate /var/lib/kubernetes/ca.pem;
             }
            }
            EOF
            mv kubernetes.default.svc.cluster.local /etc/nginx/sites-available/kubernetes.default.svc.cluster.local
            ln /etc/nginx/sites-available/kubernetes.default.svc.cluster.local /etc/nginx/sites-enabled/
            systemctl restart nginx
            systemctl restart nginx
            if [ 2 = 0 ]; then
            kubectl apply --kubeconfig admin.kubeconfig -f apiserver_create_role.yaml
            kubectl apply --kubeconfig admin.kubeconfig -f apiserver_role_bind.yaml
            kubectl config set-cluster kubernetes-the-hard-way --certificate-authority=ca.pem --embed-certs=true --server=https://35.189.54.4:6443
            kubectl config set-credentials admin --client-certificate=admin.pem --client-key=admin-key.pem
            kubectl config set-context kubernetes-the-hard-way --cluster=kubernetes-the-hard-way --user=admin
            kubectl config use-context kubernetes-the-hard-way
            echo start sleep > sleep
            sleep 2m
            kubectl apply -f https://storage.googleapis.com/kubernetes-the-hard-way/coredns-1.7.0.yaml
            kubectl create secret generic kubernetes-the-hard-way --from-literal="mykey=mydata"
            rm sleep
            fi
            echo finished! > finished
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "controller-2"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags                    = [
          + "controller",
          + "kubernetes-the-hard-way",
        ]
      + tags_fingerprint        = (known after apply)
      + zone                    = "australia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels = (known after apply)
              + size   = 200
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = "10.240.0.12"
          + subnetwork         = "https://www.googleapis.com/compute/v1/projects/kube-293902/regions/australia-southeast1/subnetworks/kubernetes"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.worker[0] will be updated in-place
  ~ resource "google_compute_instance" "worker" {
        can_ip_forward       = true
        cpu_platform         = "Intel Broadwell"
        deletion_protection  = false
        enable_display       = false
        guest_accelerator    = []
        id                   = "projects/kube-293902/zones/australia-southeast1-a/instances/worker-0"
        instance_id          = "1037648918168846911"
        label_fingerprint    = "42WmSpB8rSM="
        labels               = {}
        machine_type         = "e2-micro"
      ~ metadata             = {
            "pod-cidr" = "10.200.0.0/24"
          ~ "sshKeys"  = <<~EOT
                root:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCqt6ZaJ4Y8eZwSQOKlbmwzGWHGa0ug/gIe9Cn7zLsYe4sp5SL73qaq/tbyDHiMA1b+gcWOB58PMSR/IgdYfJkYwk0uRlC9NbmODtj6B7pfieNdRQRCq8qyxRK/HrVPsvnAdDzLbimyAt3TiBxLpepx6TPlrmY3yoVaEjyC6qhWDiU7W1jC94Nf6iYr50T608TFUB75Td5aPtOqb1Gjo9QUKp0FKWifebNYEkttkfo6Tktd8Wj2/OMBG9ly1Kff6+2mi2A/Lch0AIm2Zkv2E2C3ecZlHdaIzCiPxVUKaZcdIcQyFqWgvW251Wcg6dpmBaamCz6jlV9IoI8aUOkrdVkV
              - kevin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDutcbuixLPmIfS4cZxMzTUbdYS1Xfhap8pvBGPpAuMdvjYBqL4LH+RUiyFOZl0LTEuwMOfl6OC7FbvztDBAul2y5BeO3qFHdjSgBisSaMtAc3QXE43xhPBHZWeAMfemSLTQwr+YBepCDkx2xvxfcyaG7mkL85C1+cJh0GQX5L036Bu6Y6HV4p2whcrX4DyFKHo2euhF5QadzE1pcJzS5tIf5Lb9YtmwjSTfm+CHD70SlFfOmzcpKZ6WpGSSSD0ojSFQS5VZ/gqGsZLUhQUQlIO3FjOvlTAlfVyyKToZhf8ygwqsm3umBzEzweTqNQ9VQaCrqf9KOww/3x0Snt3u7B9W2+LWeqTtiNokkMKPYX0t8U/EfUj6nDulvwZanFCbqI/TW/hWMxsZ/0YDInNxqkxclQa3rWfgc+DusCDl6wMixj5XZNwT/+gw15P57C6ivaEJJYZi6rhoizAl/xztHCe4nEEcjqZNgBHltZwsCrD68o6fn/7ZLCpcUiabssF9rM= kevin@KevindeMac-mini
            EOT
        }
        metadata_fingerprint = "e9PJYCrgTHQ="
        name                 = "worker-0"
        project              = "kube-293902"
        self_link            = "https://www.googleapis.com/compute/v1/projects/kube-293902/zones/australia-southeast1-a/instances/worker-0"
        tags                 = [
            "kubernetes-the-hard-way",
            "worker",
        ]
        tags_fingerprint     = "XLAXZqGnY8k="
        zone                 = "australia-southeast1-a"

        boot_disk {
            auto_delete = true
            device_name = "persistent-disk-0"
            mode        = "READ_WRITE"
            source      = "https://www.googleapis.com/compute/v1/projects/kube-293902/zones/australia-southeast1-a/disks/worker-0"

            initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20201028"
                labels = {}
                size   = 200
                type   = "pd-standard"
            }
        }

        network_interface {
            name               = "nic0"
            network            = "https://www.googleapis.com/compute/v1/projects/kube-293902/global/networks/kubernetes-the-hard-way"
            network_ip         = "10.240.0.20"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/kube-293902/regions/australia-southeast1/subnetworks/kubernetes"
            subnetwork_project = "kube-293902"

            access_config {
                nat_ip       = "35.197.185.77"
                network_tier = "PREMIUM"
            }
        }

        scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }

        service_account {
            email  = "848896957875-compute@developer.gserviceaccount.com"
            scopes = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
                "https://www.googleapis.com/auth/service.management.readonly",
                "https://www.googleapis.com/auth/servicecontrol",
            ]
        }

        shielded_instance_config {
            enable_integrity_monitoring = true
            enable_secure_boot          = false
            enable_vtpm                 = true
        }
    }

  # google_compute_target_pool.target-pool will be updated in-place
  ~ resource "google_compute_target_pool" "target-pool" {
        failover_ratio   = 0
        health_checks    = [
            "https://www.googleapis.com/compute/v1/projects/kube-293902/global/httpHealthChecks/kubernetes",
        ]
        id               = "projects/kube-293902/regions/australia-southeast1/targetPools/kubernetes-target-pool"
      ~ instances        = [
            "australia-southeast1-a/controller-0",
            "australia-southeast1-a/controller-1",
          + "australia-southeast1-a/controller-2",
        ]
        name             = "kubernetes-target-pool"
        project          = "kube-293902"
        region           = "australia-southeast1"
        self_link        = "https://www.googleapis.com/compute/v1/projects/kube-293902/regions/australia-southeast1/targetPools/kubernetes-target-pool"
        session_affinity = "NONE"
    }

Plan: 3 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @zcipod, Action: `pull_request`*